//=================================================================================================================
//  Подготовка данных для вывода на печатные формы
//  
//  
// 
// 	  Редакция: Август 2023 г.
//	    Версия: 1.0.2
//=================================================================================================================


#Область Программный_интерфейс
Функция 	ЗаказНаряд_ЗаполнитьСтруктуру(Ссылка) Экспорт      
 	ФорматВыводаСуммы      		= УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Ссылка);
	ФорматВыводаКоличества 		= УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Ссылка); 
	Данные 						= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Строка(Ссылка.УникальныйИдентификатор()), "ДопРеквизиты");   	
	
	ОписаниеНеисправности 		= Ссылка.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Описание дефектов (Заказ-наряды)")));
	ОписаниеНеисправности		= ?(ОписаниеНеисправности.Количество() > 0, ОписаниеНеисправности[0].Значение, "");
	
	Струк = Новый Структура;
	Струк.Вставить("Валюта", 				Ссылка.ВалютаДокумента);
	Струк.Вставить("Заказчик",				Ссылка.СводныйРемонтныйЗаказ.Заказчик); 
	
	Автомобиль_ЗаполнитьСтруктуру(Ссылка.СводныйРемонтныйЗаказ.Автомобиль, Струк);
	Организация_ЗаполнитьСтруктуру(Ссылка.ПодразделениеКомпании, Струк);
	
	Струк.Вставить("Причина",				Ссылка.ОписаниеПричиныОбращения);
	Струк.Вставить("ОписаниеНеисправности",	ОписаниеНеисправности);
	Струк.Вставить("КодДилера",				Ссылка.Проект.КодДилера);
	Струк.Вставить("ДатаСоздания",			Ссылка.ДатаСоздания);    
	Струк.Вставить("ДатаНачала",			Ссылка.ДатаНачала);
	Струк.Вставить("ДатаФорматОкончания",	Ссылка.ДатаОкончания);
	Струк.Вставить("ДатаЗакрытия",			Ссылка.ДатаЗакрытия);
	Струк.Вставить("ПлановаяДатаВыдачи",	Ссылка.ПлановаяДатаВыдачи);
	Струк.Вставить("Номер",					Ссылка.Номер);
	Струк.Вставить("Дата",					Формат(Ссылка.Дата, "ДЛФ=D"));
	Струк.Вставить("Мастер",				Ссылка.Мастер);
	Струк.Вставить("ВидРемонта",			Ссылка.ВидРемонта);
	Струк.Вставить("Состояние",				Ссылка.Состояние); 
	
    Струк.Вставить("СуммаВсего",			Ссылка.АвтоРаботы.Итог("СуммаВсего") + Ссылка.Товары.Итог("СуммаВсего"));
	Струк.Вставить("СуммаНДС",				Ссылка.АвтоРаботы.Итог("СуммаНДС") + Ссылка.Товары.Итог("СуммаНДС"));
	Струк.Вставить("ИтоговаяСтрока",		"Всего выполнено работ на сумму " + Формат(Струк.СуммаВсего, ФорматВыводаСуммы) + " " + Струк.Валюта+ " (в т.ч. НДС " + Формат(Струк.СуммаНДС, ФорматВыводаСуммы) + " " + Струк.Валюта + ")");
	Струк.Вставить("Рекомендации",			Ссылка.Рекомендации);	

	Если Данные <> Неопределено Тогда  
		Для Каждого Элемент ИЗ Данные Цикл
			Если Элемент.Представление = "ЗапасныеЧастиВ_Багажник" Тогда    
				Струк.Вставить("СохранятьЗЧ", ?(Элемент.Значение = 1, "Да", "Нет")); 
			КонецЕсли;      
			
			Если Элемент.Представление = "КлиентОжидаетВ_Сервисе" Тогда    
				Струк.Вставить("КлиентОжидает", ?(Элемент.Значение = 1, "Клиент ожидает", "Клиент уехал"));
			КонецЕсли;    				
		КонецЦикла;			
	КонецЕсли;
	
	Возврат Струк;
КонецФункции  

// Получаем структуру с данными организации  
// Параметры заполняемые:  НаименованиеОрганизации, ФирмаЮрАдрес, ФирмаФактАдрес, ФирмаТел
Функция		Организация_ЗаполнитьСтруктуру(ПодразделениеКомпании,  СтруктураДанных = Неопределено) Экспорт
	Если СтруктураДанных = Неопределено тогда
		СтруктураДанных = Новый Структура;
	конецЕсли;
	
	СтруктураДанных.Вставить("НаименованиеОрганизации",			ПодразделениеКомпании.Организация.Наименование);
	СтруктураДанных.Вставить("НаименованиеОрганизацииПолное",	ПодразделениеКомпании.Организация.НаименованиеПолное);
	
	ФирмаЮрАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ЮрАдресПодразделенияКомпании);
	Если ПустаяСтрока(ФирмаЮрАдрес) тогда ФирмаЮрАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресПодразделенияКомпании); конецЕсли; 
	СтруктураДанных.Вставить("ФирмаЮрАдрес", ФирмаЮрАдрес);

	ФирмаФактАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ФактАдресПодразделенияКомпании);
	Если ПустаяСтрока(ФирмаФактАдрес) тогда ФирмаФактАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании.Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресПодразделенияКомпании); конецЕсли; 
	СтруктураДанных.Вставить("ФирмаФактАдрес", ФирмаФактАдрес);  

	ФирмаТел = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ТелефонПодразделенияКомпании);
	Если ПустаяСтрока(ФирмаТел) тогда ФирмаТел = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании.Организация, Справочники.ВидыКонтактнойИнформации.ТелефонПодразделенияКомпании); конецЕсли; 
	СтруктураДанных.Вставить("ФирмаТел", ФирмаТел);
	
	СтруктураДанных.Вставить("ИНН", ПодразделениеКомпании.Организация.ИНН);
	СтруктураДанных.Вставить("КПП", ПодразделениеКомпании.КПП);
	СтруктураДанных.Вставить("ИНН_КПП", стрШаблон("ИНН %1, КПП %2", ПодразделениеКомпании.Организация.ИНН, ПодразделениеКомпании.КПП));

	
	Возврат СтруктураДанных;
КонецФункции                            

Функция		Автомобиль_ЗаполнитьСтруктуру(Автомобиль, СтруктураДанных = Неопределено) Экспорт
	Если СтруктураДанных = Неопределено тогда
		СтруктураДанных = Новый Структура;
	конецЕсли;
		
	СтруктураДанных.Вставить("Хозяин", 			Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин));
	СтруктураДанных.Вставить("Пробег", 			Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег));
	СтруктураДанных.Вставить("ГосНомер", 		Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер));
	СтруктураДанных.Вставить("ДатаПродажи",		?(ЗначениеЗаполнено(Автомобиль.ДатаНачалаГарантии), Формат(Автомобиль.ДатаНачалаГарантии, "ДЛФ=Д"), ""));
	СтруктураДанных.Вставить("ГодВыпуска",		СтрЗаменить(Год(Автомобиль.ГодВыпуска), Символы.НПП, ""));
    СтруктураДанных.Вставить("VIN",				Автомобиль.VIN);
	СтруктураДанных.Вставить("Модель", 			Автомобиль.Модель);
	СтруктураДанных.Вставить("Двигатель",		Автомобиль.НомерДвигателя);
	СтруктураДанных.Вставить("ТипДвигателя",	Автомобиль.ТипДвигателя);
	СтруктураДанных.Вставить("ТипКузова",		Автомобиль.ТипКузова);
	СтруктураДанных.Вставить("Цвет",			Автомобиль.Цвет);
	СтруктураДанных.Вставить("Кузов",			Автомобиль.НомерКузова);
	СтруктураДанных.Вставить("Автомобиль",		Автомобиль);

	Возврат СтруктураДанных;
КонецФункции

Функция		Контрагент_ЗаполнитьСтруктуру(Контрагент, СтруктураДанных = Неопределено) Экспорт
	Если СтруктураДанных = Неопределено Тогда
		СтруктураДанных = Новый Структура;
	конецЕсли;

	СтруктураДанных.Вставить("ФактАдрес",		УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента));
	СтруктураДанных.Вставить("ЮрАдрес",			УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента));
	СтруктураДанных.Вставить("Телефон",			УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
	СтруктураДанных.Вставить("Email",			УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента));
	СтруктураДанных.Вставить("Web",				УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ВебСтраницаКонтрагента));
	//СтруктураДанных.Вставить("Мессенджер",		УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.УдалитьМессенджерКонтрагента));
	СтруктураДанных.Вставить("ДругаяИнформация",УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагента));
	
	Возврат СтруктураДанных;
КонецФункции

//--------------------------------------------
//-Новый-
Функция		ЗаявкаНаРемонт_ЗаполнитьСтруктуру_Новый(Ссылка, Струк = Неопределено, ПрефиксСвойства = "", Бренд = "") Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ФорматВыводаСуммы			= УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Ссылка);
	ФорматВыводаКоличества		= УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Ссылка);
	Данные						= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Строка(Ссылка.УникальныйИдентификатор()), "ДопРеквизиты");
	
	ОписаниеНеисправности		= Ссылка.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Описание дефектов (Заказ-наряды)")));
	ОписаниеНеисправности		= ?(ОписаниеНеисправности.Количество() > 0, ОписаниеНеисправности[0].Значение, "");
	
	Если Струк = Неопределено тогда
		Струк = Новый Структура;
	КонецЕсли;
	
	Струк.Вставить(ПрефиксСвойства + "Валюта",							Ссылка.ВалютаДокумента);
	Струк.Вставить(ПрефиксСвойства + "Заказчик",						Ссылка.Заказчик);
	
	Организация_ЗаполнитьСтруктуру_Новый(Ссылка.ПодразделениеКомпании,				Струк);
	Автомобиль_ЗаполнитьСтруктуру_Новый(Ссылка.Автомобиль,							Струк,	Ссылка.Дата);
	Контрагент_ЗаполнитьСтруктуру_Новый(Ссылка.Контрагент,							Струк, 	"Контрагент_");
	КонтактноеЛицо = ?(ЗначениеЗАполнено(Ссылка.Ауди_КонтактноеЛицо), Ссылка.Ауди_КонтактноеЛицо, Ссылка.Заказчик);

	Контрагент_ЗаполнитьСтруктуру_Новый(КонтактноеЛицо,								Струк, 	"КонтактноеЛицо_");
	КонтактноеЛицо_ВЛице = ?(ЗначениеЗАполнено(Ссылка.Ауди_КонтактноеЛицо),Струк["Контрагент_Наименование"] + " в лице " + Струк["КонтактноеЛицо_ФИО"],Струк["Контрагент_ФИО"]);
	Струк.Вставить("КонтактноеЛицо_ВЛице", КонтактноеЛицо_ВЛице);
		
	Контрагент_ЗаполнитьСтруктуру_Новый(Ссылка.Заказчик,							Струк, 	"Заказчик_");
	Контрагент_ЗаполнитьСтруктуру_Новый(Струк.Автомобиль_Владелец,					Струк, 	"Владелец_");
	Сотрудник_ЗаполнитьСтруктуру_Новый(Ссылка.Мастер,								Струк,	"Мастер_");
	Сотрудник_ЗаполнитьСтруктуру_Новый(Ссылка.Автор.Сотрудник,						Струк,	"Автор_");
	Владелец_ВЛице = ?(ЗначениеЗАполнено(Ссылка.Ауди_КонтактноеЛицо),Струк["Владелец_Наименование"] + " в лице " + Струк["КонтактноеЛицо_ФИО"],Струк["Владелец_ФИО"]);
	Струк.Вставить("Владелец_ВЛице",									Владелец_ВЛице);
	
	//-РАВ 24.01.2024-                                  
	Заказчик_ВЛице = ?(ЗначениеЗАполнено(Ссылка.Ауди_КонтактноеЛицо), Струк["Заказчик_ФИО"] + " в лице " + Струк["КонтактноеЛицо_ФИО"], Струк["Заказчик_ФИО"]);
	Струк.Вставить("Заказчик_ВЛице", Заказчик_ВЛице);
	
	Струк.Вставить("Программа",	"");		
	
	Если ВРег(Бренд) = "EXEED" Тогда
		Струк.Вставить("Программа",	"my CHERY");	
		
		Если Струк.Автомобиль_Владелец = Справочники.Контрагенты.НайтиПоКоду("95941") Тогда //-Сатурн-Р-Авто-
			Струк.Вставить("Владелец_EMAIL", "info.exeed@saturn-r.ru");				
		КонецЕсли;                       
	ИначеЕсли ВРег(Бренд) = "CHERY" Тогда
		Струк.Вставить("Программа",	"my CHERY");	
		                          
		Если Струк.Автомобиль_Владелец = Справочники.Контрагенты.НайтиПоКоду("95941") Тогда //-Сатурн-Р-Авто-
			Струк.Вставить("Владелец_EMAIL", "info.chery@saturn-r.ru");				
		КонецЕсли;		
	ИначеЕсли ВРег(Бренд) = "OMODA" Тогда
		Струк.Вставить("Программа",	"my OMODA");		
		
		Если Струк.Автомобиль_Владелец = Справочники.Контрагенты.НайтиПоКоду("95941") Тогда //-Сатурн-Р-Авто-
			Струк.Вставить("Владелец_EMAIL", "info.omoda@saturn-r.ru");				
		КонецЕсли;				
	КонецЕсли;
	//-РАВ 24.01.2024-		
		
	СтраховаяКомпания = Ложь;
	
	Если НЕ ТипЗнч(Ссылка.Контрагент) = Тип("Строка") Тогда
		СтраховаяКомпания = ra_ОбщийМодульНаСервере.ПолучитьЗначениеДополнительныеРеквизитыИСведения(Ссылка.Контрагент, ra_ОбщийМодульНаСервере.ПризнакСтраховая()) ИЛИ СокрЛП(Ссылка.Контрагент.Код) = "95941"; //-РАВ 18.09.2023-
	КонецЕсли;
	
	Если СтраховаяКомпания Тогда
		Струк.Вставить(ПрефиксСвойства + "Заказчик_НаименованиеКузовной",			Струк["Контрагент_НаименованиеПолное"]);
	иначе
		Струк.Вставить(ПрефиксСвойства + "Заказчик_НаименованиеКузовной",			Струк[ПрефиксСвойства +"Заказчик"].НаименованиеПолное);
	КонецЕсли;
	
	Струк.Вставить(ПрефиксСвойства + "Заголовок",						"№" + Ссылка.Номер + " от " + Формат(Ссылка.Дата, "ДФ=""дд.ММ.гггг"""));
	Струк.Вставить(ПрефиксСвойства + "Причина",							Ссылка.ОписаниеПричиныОбращения);
	Струк.Вставить(ПрефиксСвойства + "ЗН_Пробег",						?(ЗначениеЗаполнено(Ссылка.Пробег),Ссылка.Пробег,Струк.Автомобиль_Пробег));
	Струк.Вставить(ПрефиксСвойства + "ОписаниеНеисправности",			ОписаниеНеисправности);
	Струк.Вставить(ПрефиксСвойства + "КодДилера",						Ссылка.Проект.КодДилера);
	Струк.Вставить(ПрефиксСвойства + "Номер",							Ссылка.Номер);
	Струк.Вставить(ПрефиксСвойства + "ВидРемонта",						Ссылка.ВидРемонта);
	
	Струк.Вставить(ПрефиксСвойства + "Дата",							Ссылка.Дата);	
	Струк.Вставить(ПрефиксСвойства + "Дата_ДД_ММ_ГГГГ",					формат(Ссылка.Дата,"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "Дата_ДатаИВремя",					формат(Ссылка.Дата,"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "Дата_Время",						формат(Ссылка.Дата,"ДФ='HH:mm'"));
	
	Струк.Вставить(ПрефиксСвойства + "ДатаСоздания",					Ссылка.ДатаСоздания);    
	Струк.Вставить(ПрефиксСвойства + "ДатаСоздания_ДД_ММ_ГГГГ",			формат(Струк[ПрефиксСвойства +"ДатаСоздания"],"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ДатаСоздания_ДатаИВремя",			формат(Струк[ПрефиксСвойства +"ДатаСоздания"],"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ДатаСоздания_Время",				формат(Струк[ПрефиксСвойства +"ДатаСоздания"],"ДФ='HH:mm'"));
	
	Струк.Вставить(ПрефиксСвойства + "ДатаНачала",						Ссылка.ДатаНачала);
	Струк.Вставить(ПрефиксСвойства + "ДатаНачала_ДД_ММ_ГГГГ",			формат(Струк[ПрефиксСвойства +"ДатаНачала"],"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ДатаНачала_ДатаИВремя",			формат(Струк[ПрефиксСвойства +"ДатаНачала"],"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ДатаНачала_Время",				формат(Струк[ПрефиксСвойства +"ДатаНачала"],"ДФ='HH:mm'"));
	
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончания",					Ссылка.ДатаОкончания);
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончания_ДД_ММ_ГГГГ",		формат(Струк[ПрефиксСвойства +"ДатаОкончания"],"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончания_ДатаИВремя",		формат(Струк[ПрефиксСвойства +"ДатаОкончания"],"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончания_Время",				формат(Струк[ПрефиксСвойства +"ДатаОкончания"],"ДФ='HH:mm'"));
	
	ДатаПечати = ТекущаяДата();
	Струк.Вставить(ПрефиксСвойства + "ДатаПечати",						ДатаПечати);
	Струк.Вставить(ПрефиксСвойства + "ДатаПечати_ДД_ММ_ГГГГ",			формат(ДатаПечати,"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ДатаПечати_ДатаИВремя",			формат(ДатаПечати,"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ДатаПечати_Время",				формат(ДатаПечати,"ДФ='HH:mm'"));

	Струк.Вставить(ПрефиксСвойства + "Мастер",							Ссылка.Мастер);
	Струк.Вставить(ПрефиксСвойства + "Мастер_ФИО",						ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Ссылка.Мастер.Наименование));

	ВидРемонтаГарантия = Ссылка.ВидРемонта.Гарантия.Найти(Ссылка.Автомобиль.Марка, "Марка");
	
	#Область СуммыАвторабот
	Струк.Вставить(ПрефиксСвойства + "СуммаЧасовРабот",		0);
	
	Для каждого строкаРабот из Ссылка.АвтоРаботы Цикл
		Струк.Вставить(ПрефиксСвойства + "СуммаЧасовРабот",	Струк[ПрефиксСвойства + "СуммаЧасовРабот"] + строкаРабот.Количество * строкаРабот.Коэффициент );
	КонецЦикла;
	
	Струк.Вставить(ПрефиксСвойства + "СуммаРабот",						Ссылка.АвтоРаботы.Итог("Сумма"));
	Струк.Вставить(ПрефиксСвойства + "СуммаВсегоРабот",					Ссылка.АвтоРаботы.Итог("СуммаВсего"));
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботДокумента",				Ссылка.СуммаРаботДокумента);
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботНДС",					Ссылка.АвтоРаботы.Итог("СуммаНДС"));
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботСкидки",				Ссылка.АвтоРаботы.Итог("СуммаСкидки") + Ссылка.АвтоРаботы.Итог("СуммаСкидкиСтроки"));
	Струк.Вставить(ПрефиксСвойства + "ИтогоНормоВремени",				Ссылка.АвтоРаботы.Итог("Коэффициент"));
	
	Струк.Вставить(ПрефиксСвойства + "СуммаРабот_2",					Формат(Струк[ПрефиксСвойства +"СуммаРабот"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботДокумента_2",			Формат(Струк[ПрефиксСвойства +"СуммаРаботДокумента"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботНДС_2",					Формат(Струк[ПрефиксСвойства +"СуммаРаботНДС"],"ЧДЦ=2"));	
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботСкидки_2",				Формат(Струк[ПрефиксСвойства +"СуммаРаботСкидки"],"ЧДЦ=2"));
	#КонецОбласти             
	
	#Область СуммыНоменклатуры
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатуры",				Ссылка.Товары.Итог("Сумма"));
	Струк.Вставить(ПрефиксСвойства + "СуммаВсегоНоменклатуры",			Ссылка.Товары.Итог("СуммаВсего"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыДокумента",		Ссылка.СуммаНоменклатурыДокумента);
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыНДС",			Ссылка.Товары.Итог("СуммаНДС"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыСкидки",			Ссылка.Товары.Итог("СуммаСкидки") + Ссылка.Товары.Итог("СуммаСкидкиСтроки")); 
	Струк.Вставить(ПрефиксСвойства + "КоличествоНоменклатуры",			Ссылка.Товары.Итог("Количество"));
	
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатуры_2",				Формат(Струк[ПрефиксСвойства +"СуммаНоменклатуры"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыДокумента_2",	Формат(Струк[ПрефиксСвойства +"СуммаНоменклатурыДокумента"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыНДС_2",			Формат(Струк[ПрефиксСвойства +"СуммаНоменклатурыНДС"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыСкидки_2",		Формат(Струк[ПрефиксСвойства +"СуммаНоменклатурыСкидки"],"ЧДЦ=2"));   
	#КонецОбласти      
	
	#Область СуммыДокумента
	Струк.Вставить(ПрефиксСвойства + "СуммаВсего",						Ссылка.АвтоРаботы.Итог("СуммаВсего") + Ссылка.Товары.Итог("СуммаВсего"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНДС",						Ссылка.АвтоРаботы.Итог("СуммаНДС") + Ссылка.Товары.Итог("СуммаНДС"));
	Струк.Вставить(ПрефиксСвойства + "СуммаДокумента",					Ссылка.СуммаДокумента);
	Струк.Вставить(ПрефиксСвойства + "Сумма",							Ссылка.АвтоРаботы.Итог("Сумма") + Ссылка.Товары.Итог("Сумма")); 
	Струк.Вставить(ПрефиксСвойства + "СуммаСкидкиНаценки",				Струк[ПрефиксСвойства +"Сумма"] - Струк[ПрефиксСвойства +"СуммаДокумента"]);                                              
	
	Струк.Вставить(ПрефиксСвойства + "СуммаВсего_2",					Формат(Струк[ПрефиксСвойства +"СуммаВсего"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНДС_2",						Формат(Струк[ПрефиксСвойства +"СуммаНДС"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаСкидкиНаценки_2",			Формат(Струк[ПрефиксСвойства +"СуммаСкидкиНаценки"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаДокумента_2",				Формат(Струк[ПрефиксСвойства +"СуммаДокумента"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "Сумма_2",							Формат(Струк[ПрефиксСвойства +"Сумма"],"ЧДЦ=2"));
	#КонецОбласти  
	
	
	Струк.Вставить(ПрефиксСвойства + "СуммаВсегоДокументаПрописью",			ЧислоПрописью(Струк[ПрефиксСвойства +"СуммаВсего"],"Л = ru_RU; НД = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));  	
	Струк.Вставить(ПрефиксСвойства + "СуммаНДСПрописью",					ЧислоПрописью(Струк[ПрефиксСвойства +"СуммаНДС"],"Л = ru_RU; НД = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));  	
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыДокументаПрописью",	ЧислоПрописью(Струк[ПрефиксСвойства +"СуммаНоменклатурыДокумента"],"Л = ru_RU; НД = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботДокументаПрописью",			ЧислоПрописью(Струк[ПрефиксСвойства +"СуммаРаботДокумента"],"Л = ru_RU; НД = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
		
	Струк.Вставить(ПрефиксСвойства + "ИтоговаяСтрока",					"Всего выполнено работ на сумму " + ЧислоПрописью(Струк[ПрефиксСвойства +"СуммаВсего"], ФорматВыводаСуммы) + " " + Струк[ПрефиксСвойства +"Валюта"] + " (в т.ч. НДС " + Формат(Струк[ПрефиксСвойства +"СуммаНДС"], ФорматВыводаСуммы) + " " + Струк[ПрефиксСвойства +"Валюта"] + ")");

	Возврат Струк;	
КонецФункции

Функция		ЗаказНаряд_ЗаполнитьСтруктуру_Новый(Ссылка, Струк = Неопределено, ПрефиксСвойства = "", Бренд = "") Экспорт
	УстановитьПривилегированныйРежим(Истина);  
	ДатаПечати 					= ТекущаяДата();
	ФорматВыводаСуммы			= УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Ссылка);
	ФорматВыводаКоличества		= УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Ссылка);
	Данные						= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Строка(Ссылка.УникальныйИдентификатор()), "ДопРеквизиты");
	
	ОписаниеНеисправности		= Ссылка.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Описание дефектов (Заказ-наряды)")));
	ОписаниеНеисправности		= ?(ОписаниеНеисправности.Количество() > 0, ОписаниеНеисправности[0].Значение, "");
	
	Если Струк = Неопределено тогда
		Струк = Новый Структура;
	КонецЕсли;
	
	Струк.Вставить(ПрефиксСвойства + "Ссылка",									Ссылка);//-РАВ 01.08.2024-	
	Струк.Вставить(ПрефиксСвойства + "Дата",									Ссылка.Дата);	
	Струк.Вставить(ПрефиксСвойства + "Дата_ДД_ММ_ГГГГ",							формат(Ссылка.Дата,"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "Дата_ДатаИВремя",							формат(Ссылка.Дата,"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "Дата_Время",								формат(Ссылка.Дата,"ДФ='HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "Валюта",									Ссылка.ВалютаДокумента);
	Струк.Вставить(ПрефиксСвойства + "Заказчик",								Ссылка.СводныйРемонтныйЗаказ.Заказчик);
	Струк.Вставить(ПрефиксСвойства + "Контрагент",								Ссылка.Контрагент);
	Струк.Вставить(ПрефиксСвойства + "ИдентификаторГосударственногоКонтракта",	?(ЗначениеЗаполнено(Ссылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта),"Идентификатор государственного контракта, договора (соглашения): " + Ссылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта , ""));
	Струк.Вставить(ПрефиксСвойства + "ДатаСледующегоТО",						?(ЗначениеЗаполнено(Ссылка.ДатаСледующегоТО), Формат(Ссылка.ДатаСледующегоТО, "ДФ=dd.MM.yyyy"), ""));
	
	//-РАВ 24.10.2025 Задача №000005158-                  
	Если (Струк.Свойство("ЗаказНаряд_Заказчик") И Струк.ЗаказНаряд_Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо) ИЛИ (Струк.Свойство("Заказчик") И Струк.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо) Тогда
		Струк.Вставить("ИнформацияПодвала", "В случае признания Исполнителем недостатков, обнаруженных при проведении диагностики автомобиля, указанного в настоящем заказе-наряде, попадающих под действие предоставленной гарантии, Заказчик просит Исполнителя провести безвозмездное устранение этих недостатков автомобиля. При этом Исполнитель подтверждает, а Заказчик соглашается с тем, что диагностика автомобиля в этом случае является безвозмездной для Заказчика, и устранение выявленного недостатка должно быть произведено в срок до 90 (Девяносто) дней. 
											|В случае необходимости с Заказчиком может быть согласован иной срок ремонта.");
	Иначе
		Струк.Вставить("ИнформацияПодвала", "Я подтверждаю, что в случае признания Исполнителем недостатков, обнаруженных при проведении диагностики автомобиля, указанного в настоящем заказе-наряде, попадающими под действие предоставленной гарантии, прошу Исполнителя провести безвозмездное устранение этих недостатков автомобиля. При этом Исполнитель подтверждает, а Заказчик соглашается стем, что диагностика автомобиля в этом случае является безвозмездной для Заказчика, и устранение выявленного недостатка должно быть произведено в срок не позднее 45 (сорок пять) дней.
											|Согласно ст. 18, 20 Закона РФ 'О защите прав потребителей срок' устранения производственных недостатков товара, определяемый в письменной форме соглашением сторон, составляет 45 дней. Стороны пришли к соглашению: В случае, если потребитель прервал срок устранения недостатка путем отказа от безвозмездного устранения недостатков или забрал автомобиль из сервиса, сторонами (потребителем и производителем, импортером, продавцом, уполномоченной организацией) признается, что течение 45-дневного срока не началось».");
	КонецЕсли;
	//-РАВ 24.10.2025-
	
	Организация_ЗаполнитьСтруктуру_Новый(Ссылка.ПодразделениеКомпании,				Струк);
	Автомобиль_ЗаполнитьСтруктуру_Новый(Ссылка.СводныйРемонтныйЗаказ.Автомобиль,	Струк,	Ссылка.Дата);
	Контрагент_ЗаполнитьСтруктуру_Новый(Ссылка.Контрагент,							Струк, 	"Контрагент_");
	КонтактноеЛицо = ?(ЗначениеЗАполнено(Ссылка.Ауди_КонтактноеЛицо),Ссылка.Ауди_КонтактноеЛицо,Ссылка.СводныйРемонтныйЗаказ.Заказчик);

	Контрагент_ЗаполнитьСтруктуру_Новый(КонтактноеЛицо,								Струк, 	"КонтактноеЛицо_");
	КонтактноеЛицо_ВЛице = ?(ЗначениеЗАполнено(Ссылка.Ауди_КонтактноеЛицо),Струк["Контрагент_Наименование"] + " в лице " + Струк["КонтактноеЛицо_ФИО"],Струк["Контрагент_ФИО"]);
	Струк.Вставить("КонтактноеЛицо_ВЛице", КонтактноеЛицо_ВЛице);  
	Струк.Вставить("КонтактноеЛицо", КонтактноеЛицо);
		
	Контрагент_ЗаполнитьСтруктуру_Новый(Ссылка.СводныйРемонтныйЗаказ.Заказчик												, Струк, 	"Заказчик_");
	Контрагент_ЗаполнитьСтруктуру_Новый(Струк.Автомобиль_Владелец															, Струк, 	"Владелец_");
	Сотрудник_ЗаполнитьСтруктуру_Новый(Ссылка.Мастер																		, Струк,	"Мастер_");
	Сотрудник_ЗаполнитьСтруктуру_Новый(?(ЗначениеЗаполнено(Ссылка.Ауди_МастерЦеха), Ссылка.Ауди_МастерЦеха, Ссылка.Мастер)	, Струк,	"МастерЦеха_");
	Сотрудник_ЗаполнитьСтруктуру_Новый(Ссылка.Автор.Сотрудник																, Струк,	"Автор_");
	
	Владелец_ВЛице = ?(ЗначениеЗАполнено(Ссылка.Ауди_КонтактноеЛицо),Струк["Владелец_Наименование"] + " в лице " + Струк["КонтактноеЛицо_ФИО"],Струк["Владелец_ФИО"]);
	Струк.Вставить("Владелец_ВЛице",									Владелец_ВЛице);
	
	//-РАВ 24.01.2024-                                  
	Заказчик_ВЛице = ?(ЗначениеЗАполнено(Ссылка.Ауди_КонтактноеЛицо), Струк["Заказчик_ФИО"] + " в лице " + Струк["КонтактноеЛицо_ФИО"], Струк["Заказчик_ФИО"]);
	Струк.Вставить("Заказчик_ВЛице", Заказчик_ВЛице);
	
	Струк.Вставить("Бренд"		,	Бренд);	
	Струк.Вставить("Программа"	,	"");		
	
	Если ВРег(Бренд) = "EXEED" Тогда
		Струк.Вставить("Программа",	"my CHERY");	
		
		Если Струк.Автомобиль_Владелец = Справочники.Контрагенты.НайтиПоКоду("95941") Тогда //-Сатурн-Р-Авто-
			Струк.Вставить("Владелец_EMAIL", "info.exeed@saturn-r.ru");				
		КонецЕсли;                       
	ИначеЕсли ВРег(Бренд) = "TENET" Тогда
		Струк.Вставить("Программа",	"my CHERY");	
		                          
		Если Струк.Автомобиль_Владелец = Справочники.Контрагенты.НайтиПоКоду("95941") Тогда //-Сатурн-Р-Авто-
			Струк.Вставить("Владелец_EMAIL", "info.chery@saturn-r.ru");				
		КонецЕсли;		
	ИначеЕсли ВРег(Бренд) = "OMODA" Тогда
		Струк.Вставить("Программа",	"my OMODA");		
		
		Если Струк.Автомобиль_Владелец = Справочники.Контрагенты.НайтиПоКоду("95941") Тогда //-Сатурн-Р-Авто-
			Струк.Вставить("Владелец_EMAIL", "info.omoda@saturn-r.ru");				
		КонецЕсли;				
	КонецЕсли;
	//-РАВ 24.01.2024-		
	
	//-РАВ 12.03.2024-
	Струк.Вставить("СкидкаРаботы"	, Ссылка.Автоработы.Итог("СуммаСкидки") + Ссылка.Автоработы.Итог("СуммаСкидкиСтроки"));
	Струк.Вставить("СкидкаЗапчасти"	, Ссылка.Товары.Итог("СуммаСкидки") + Ссылка.Товары.Итог("СуммаСкидкиСтроки"));
	//-РАВ 12.03.2024-
	
	СтраховаяКомпания = Ложь;
	
	Если НЕ ТипЗнч(Ссылка.Контрагент) = Тип("Строка") Тогда
		СтраховаяКомпания = ra_ОбщийМодульНаСервере.ПолучитьЗначениеДополнительныеРеквизитыИСведения(Ссылка.Контрагент, ra_ОбщийМодульНаСервере.ПризнакСтраховая()) ИЛИ СокрЛП(Ссылка.Контрагент.Код) = "95941"; //-РАВ 18.09.2023-
	КонецЕсли;
	
	Если СтраховаяКомпания Тогда
		Струк.Вставить(ПрефиксСвойства + "Заказчик_НаименованиеКузовной",			Струк["Контрагент_НаименованиеПолное"]);
	иначе
		Струк.Вставить(ПрефиксСвойства + "Заказчик_НаименованиеКузовной",			Струк[ПрефиксСвойства +"Заказчик"].НаименованиеПолное);
	КонецЕсли;
	
	Струк.Вставить(ПрефиксСвойства + "Заголовок",						"№" + Ссылка.Номер + " от " + Формат(Ссылка.Дата, "ДФ=""дд.ММ.гггг"""));
	Струк.Вставить(ПрефиксСвойства + "Причина",							Ссылка.ОписаниеПричиныОбращения);
	
	Причины = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Ссылка.ОписаниеПричиныОбращения, ";");
	
	Если Причины.Количество() > 0 Тогда  
		Кол = 0;
		
		Для Каждого пр ИЗ Причины Цикл
			Кол = Кол + 1;
			
			Струк.Вставить(ПрефиксСвойства + "Причина" + Строка(Кол),	СокрЛП(пр));			
		КонецЦикла;
		
		Для Ном = Кол + 1 ПО 10 Цикл
			Струк.Вставить(ПрефиксСвойства + "Причина" + Строка(Ном),	"");			
		КонецЦикла;
	КонецЕсли; 
	
	Кол = 0;
	
	Для Каждого мат ИЗ Ссылка.МатериалыЗаказчика Цикл   
		Кол = Кол + 1;
		Струк.Вставить(ПрефиксСвойства + "МатериалЗаказчика" + Строка(Кол),	СтрШаблон("%1 - %2(%3)", мат.Номенклатура, мат.Количество, мат.ЕдиницаИзмерения));
	КонецЦикла;                             
	
	Для Ном = Кол + 1 ПО 10 Цикл
		Струк.Вставить(ПрефиксСвойства + "МатериалЗаказчика" + Строка(Ном),	"");
	КонецЦикла;
	//-РАВ 05.02.2025-   
	
	Струк.Вставить(ПрефиксСвойства + "ЗН_Пробег",						?(ЗначениеЗаполнено(Ссылка.Пробег),Ссылка.Пробег,Струк.Автомобиль_Пробег));
	Струк.Вставить(ПрефиксСвойства + "ОписаниеНеисправности",			ОписаниеНеисправности);
	Струк.Вставить(ПрефиксСвойства + "КодДилера",						Ссылка.Проект.КодДилера);
	Струк.Вставить(ПрефиксСвойства + "Номер",							Ссылка.Номер);
	Струк.Вставить(ПрефиксСвойства + "ВидРемонта",						Ссылка.ВидРемонта);
	
	Струк.Вставить(ПрефиксСвойства + "ДатаСоздания",					Ссылка.ДатаСоздания);    
	Струк.Вставить(ПрефиксСвойства + "ДатаСоздания_ДД_ММ_ГГГГ",			формат(Струк[ПрефиксСвойства +"ДатаСоздания"],"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ДатаСоздания_ДатаИВремя",			формат(Струк[ПрефиксСвойства +"ДатаСоздания"],"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ДатаСоздания_Время",				формат(Струк[ПрефиксСвойства +"ДатаСоздания"],"ДФ='HH:mm'"));
	
	Струк.Вставить(ПрефиксСвойства + "ДатаНачала",						Ссылка.ДатаНачала);
	Струк.Вставить(ПрефиксСвойства + "ДатаНачала_ДД_ММ_ГГГГ",			формат(Струк[ПрефиксСвойства +"ДатаНачала"],"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ДатаНачала_ДатаИВремя",			формат(Струк[ПрефиксСвойства +"ДатаНачала"],"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ДатаНачала_Время",				формат(Струк[ПрефиксСвойства +"ДатаНачала"],"ДФ='HH:mm'"));
	
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончания",					Ссылка.ДатаОкончания);
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончания_ДД_ММ_ГГГГ",		формат(Струк[ПрефиксСвойства +"ДатаОкончания"],"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончания_ДатаИВремя",		формат(Струк[ПрефиксСвойства +"ДатаОкончания"],"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончания_Время",				формат(Струк[ПрефиксСвойства +"ДатаОкончания"],"ДФ='HH:mm'"));
	
	Струк.Вставить(ПрефиксСвойства + "ДатаЗакрытия",					?(ЗначениеЗаполнено(Ссылка.ДатаЗакрытия), Ссылка.ДатаЗакрытия, ""));
	Струк.Вставить(ПрефиксСвойства + "ДатаЗакрытия_ДД_ММ_ГГГГ",			формат(Струк[ПрефиксСвойства +"ДатаЗакрытия"],"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ДатаЗакрытия_ДатаИВремя",			формат(Струк[ПрефиксСвойства +"ДатаЗакрытия"],"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ДатаЗакрытия_Время",				формат(Струк[ПрефиксСвойства +"ДатаЗакрытия"],"ДФ='HH:mm'"));
	
	Струк.Вставить(ПрефиксСвойства + "ПлановаяДатаВыдачи",				?(ЗначениеЗаполнено(Ссылка.ПлановаяДатаВыдачи), Ссылка.ПлановаяДатаВыдачи, ""));
	Струк.Вставить(ПрефиксСвойства + "ПлановаяДатаВыдачи_ДД_ММ_ГГГГ",	формат(Струк[ПрефиксСвойства +"ПлановаяДатаВыдачи"],"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ПлановаяДатаВыдачи_ДатаИВремя",	формат(Струк[ПрефиксСвойства +"ПлановаяДатаВыдачи"],"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ПлановаяДатаВыдачи_Время",		формат(Струк[ПрефиксСвойства +"ПлановаяДатаВыдачи"],"ДФ='HH:mm'"));
	
	Струк.Вставить(ПрефиксСвойства + "ДатаПечати",						ДатаПечати);
	Струк.Вставить(ПрефиксСвойства + "ДатаПечати_ДД_ММ_ГГГГ",			формат(ДатаПечати,"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ДатаПечати_ДатаИВремя",			формат(ДатаПечати,"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ДатаПечати_Время",				формат(ДатаПечати,"ДФ='HH:mm'"));

	Струк.Вставить(ПрефиксСвойства + "Мастер",							Ссылка.Мастер);
	Струк.Вставить(ПрефиксСвойства + "Мастер_ФИО",						ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Ссылка.Мастер.Наименование));
	
	//-РАВ 01.08.2024-
	Если ЗначениеЗаполнено(Ссылка.Ауди_МастерЦеха) Тогда
		Струк.Вставить(ПрефиксСвойства + "МастерЦеха",					Ссылка.Ауди_МастерЦеха);
		Струк.Вставить(ПрефиксСвойства + "МастерЦеха_ФИО",				ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Ссылка.Ауди_МастерЦеха.Наименование));		
	Иначе
		Струк.Вставить(ПрефиксСвойства + "МастерЦеха",					Ссылка.Мастер);
		Струк.Вставить(ПрефиксСвойства + "МастерЦеха_ФИО",				ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Ссылка.Мастер.Наименование));		
	КонецЕсли;
	//-РАВ 01.08.2024-

	//-РАВ 12.01.2026-
	Если Ссылка.СводныйРемонтныйЗаказ.Автомобиль.Марка = Справочники.Марки.HAVAL() И Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГудвилКуланц() Тогда
		Струк.Вставить(ПрефиксСвойства + "ВидРемонта",					"Ремонт в рамках программы сервисной поддержки постгарантийного обслуживания");
	КонецЕсли;
	//-РАВ 12.01.2026-
		
	ВидРемонтаГарантия = Ссылка.ВидРемонта.Гарантия.Найти(Ссылка.СводныйРемонтныйЗаказ.Автомобиль.Марка, "Марка");
	Струк.Вставить(ПрефиксСвойства + "ТипРемонта",						?(ВидРемонтаГарантия <> Неопределено, ?(ЗначениеЗаполнено(Ссылка.СервиснаяКампания), "СЕРВИСНОЕ МЕРОПРИЯТИЕ", "ГАРАНТИЯ ПРОИЗВОДИТЕЛЯ"), ?(Ссылка.ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Платный И (НЕ ЗначениеЗаполнено(Ссылка.ПроектДляЗачета) ИЛИ Ссылка.Организация.ИНН <> Ссылка.Контрагент.ИНН), "КОММЕРЧЕСКИЙ", "ВНУТРЕННИЙ")));
	Струк.Вставить(ПрефиксСвойства + "СервиснаяКампания",				?(ЗначениеЗаполнено(Ссылка.СервиснаяКампания), Ссылка.СервиснаяКампания.Наименование, ""));
	Струк.Вставить(ПрефиксСвойства + "СервиснаяКампанияНомер",			?(ЗначениеЗаполнено(Ссылка.СервиснаяКампания), Ссылка.СервиснаяКампания.Артикул, ""));
	Струк.Вставить(ПрефиксСвойства + "Состояние",						Ссылка.Состояние);
	
		#Область СуммыАвторабот
	
	Струк.Вставить(ПрефиксСвойства + "СуммаЧасовРабот",		0);
	
	Для каждого строкаРабот из Ссылка.АвтоРаботы Цикл
		Струк.Вставить(ПрефиксСвойства + "СуммаЧасовРабот",	Струк[ПрефиксСвойства + "СуммаЧасовРабот"] + строкаРабот.Количество * строкаРабот.Коэффициент );
	КонецЦикла;
	
	Струк.Вставить(ПрефиксСвойства + "СуммаРабот",						Ссылка.АвтоРаботы.Итог("Сумма"));
	Струк.Вставить(ПрефиксСвойства + "СуммаВсегоРабот",					Ссылка.АвтоРаботы.Итог("СуммаВсего"));
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботДокумента",				Ссылка.СуммаРаботДокумента);
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботНДС",					Ссылка.АвтоРаботы.Итог("СуммаНДС"));
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботСкидки",				Ссылка.АвтоРаботы.Итог("СуммаСкидки") + Ссылка.АвтоРаботы.Итог("СуммаСкидкиСтроки"));
	Струк.Вставить(ПрефиксСвойства + "ИтогоНормоВремени",				Ссылка.АвтоРаботы.Итог("Коэффициент"));
	
	Струк.Вставить(ПрефиксСвойства + "СуммаРабот_2",					Формат(Струк[ПрефиксСвойства +"СуммаРабот"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботДокумента_2",			Формат(Струк[ПрефиксСвойства +"СуммаРаботДокумента"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботНДС_2",					Формат(Струк[ПрефиксСвойства +"СуммаРаботНДС"],"ЧДЦ=2"));	
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботСкидки_2",				Формат(Струк[ПрефиксСвойства +"СуммаРаботСкидки"],"ЧДЦ=2"));

	#КонецОбласти    
	
	#Область СуммыНоменклатуры
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатуры",				Ссылка.Товары.Итог("Сумма"));
	Струк.Вставить(ПрефиксСвойства + "СуммаВсегоНоменклатуры",			Ссылка.Товары.Итог("СуммаВсего"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыДокумента",		Ссылка.СуммаНоменклатурыДокумента);
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыНДС",			Ссылка.Товары.Итог("СуммаНДС"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыСкидки",			Ссылка.Товары.Итог("СуммаСкидки") + Ссылка.Товары.Итог("СуммаСкидкиСтроки")); 
	Струк.Вставить(ПрефиксСвойства + "КоличествоНоменклатуры",			Ссылка.Товары.Итог("Количество"));
	
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатуры_2",				Формат(Струк[ПрефиксСвойства +"СуммаНоменклатуры"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыДокумента_2",	Формат(Струк[ПрефиксСвойства +"СуммаНоменклатурыДокумента"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыНДС_2",			Формат(Струк[ПрефиксСвойства +"СуммаНоменклатурыНДС"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыСкидки_2",		Формат(Струк[ПрефиксСвойства +"СуммаНоменклатурыСкидки"],"ЧДЦ=2"));   
	#КонецОбласти
	
	#Область СуммыДокумента
	Струк.Вставить(ПрефиксСвойства + "СуммаВсего",						Ссылка.АвтоРаботы.Итог("СуммаВсего") + Ссылка.Товары.Итог("СуммаВсего"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНДС",						Ссылка.АвтоРаботы.Итог("СуммаНДС") + Ссылка.Товары.Итог("СуммаНДС"));
	Струк.Вставить(ПрефиксСвойства + "СуммаБонусами",					Ссылка.АвтоРаботы.Итог("СуммаСкидкиБонусами") + Ссылка.Товары.Итог("СуммаСкидкиБонусами"));
	Струк.Вставить(ПрефиксСвойства + "СуммаДокумента",					Ссылка.СуммаДокумента);
	Струк.Вставить(ПрефиксСвойства + "Сумма",							Ссылка.АвтоРаботы.Итог("Сумма") + Ссылка.Товары.Итог("Сумма")); 
	Струк.Вставить(ПрефиксСвойства + "СуммаСкидкиНаценки",				Струк[ПрефиксСвойства +"Сумма"] - Струк[ПрефиксСвойства +"СуммаДокумента"]);                                              
	
	Струк.Вставить(ПрефиксСвойства + "СуммаВсего_2",					Формат(Струк[ПрефиксСвойства +"СуммаВсего"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаНДС_2",						Формат(Струк[ПрефиксСвойства +"СуммаНДС"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаСкидкиНаценки_2",			Формат(Струк[ПрефиксСвойства +"СуммаСкидкиНаценки"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаДокумента_2",				Формат(Струк[ПрефиксСвойства +"СуммаДокумента"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "Сумма_2",							Формат(Струк[ПрефиксСвойства +"Сумма"],"ЧДЦ=2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаБонусами_2",					Формат(Струк[ПрефиксСвойства +"СуммаБонусами"],"ЧДЦ=2"));
	#КонецОбласти  
	
	Струк.Вставить(ПрефиксСвойства + "СуммаВсегоДокументаПрописью",			ЧислоПрописью(Струк[ПрефиксСвойства +"СуммаВсего"],"Л = ru_RU; НД = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));  	
	Струк.Вставить(ПрефиксСвойства + "СуммаНДСПрописью",					ЧислоПрописью(Струк[ПрефиксСвойства +"СуммаНДС"],"Л = ru_RU; НД = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));  	
	Струк.Вставить(ПрефиксСвойства + "СуммаНоменклатурыДокументаПрописью",	ЧислоПрописью(Струк[ПрефиксСвойства +"СуммаНоменклатурыДокумента"],"Л = ru_RU; НД = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
	Струк.Вставить(ПрефиксСвойства + "СуммаРаботДокументаПрописью",			ЧислоПрописью(Струк[ПрефиксСвойства +"СуммаРаботДокумента"],"Л = ru_RU; НД = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
	
	Струк.Вставить(ПрефиксСвойства + "ИтоговаяСтрока",					"Всего выполнено работ на сумму " + ЧислоПрописью(Струк[ПрефиксСвойства +"СуммаВсего"], ФорматВыводаСуммы) + " " + Струк[ПрефиксСвойства +"Валюта"] + " (в т.ч. НДС " + Формат(Струк[ПрефиксСвойства +"СуммаНДС"], ФорматВыводаСуммы) + " " + Струк[ПрефиксСвойства +"Валюта"] + ")");
	Струк.Вставить(ПрефиксСвойства + "Рекомендации",					Ссылка.Рекомендации);	
	Струк.Вставить(ПрефиксСвойства + "ПроектДляЗачета",					Ссылка.ПроектДляЗачета);

	Если Данные <> Неопределено Тогда  
		Для Каждого Элемент ИЗ Данные Цикл
			Если Элемент.Представление = "ЗапасныеЧастиВ_Багажник" Тогда    
				Струк.Вставить(ПрефиксСвойства + "СохранятьЗЧ", ?(Элемент.Значение = 0, "---", ?(Элемент.Значение = 1, "Да", "Нет"))); 
			ИначеЕсли Элемент.Представление = "КлиентОжидаетВ_Сервисе" Тогда    
				Струк.Вставить(ПрефиксСвойства + "КлиентОжидает", ?(Элемент.Значение = 0, "---", ?(Элемент.Значение = 1, "Клиент ожидает", "Клиент уехал")));
			ИначеЕсли Элемент.Представление = "АвтомобильПроверенНаАкции" Тогда    
				Струк.Вставить(ПрефиксСвойства + "АвтомобильПроверенНаАкции", ?(Элемент.Значение = 0, "---", ?(Элемент.Значение = 1, "Да", "Нет")));
			ИначеЕсли Элемент.Представление = "СогласованиеДопРабот" Тогда    
				Струк.Вставить(ПрефиксСвойства + "СогласованиеДопРабот", ?(Элемент.Значение = 0, "---", ?(Элемент.Значение = 1, "Да", "Нет")));
			ИначеЕсли Элемент.Представление = "ПолучениеОфициальныхУведомлений" Тогда    
				Струк.Вставить(ПрефиксСвойства + "ПолучениеОфициальныхУведомлений", ?(Элемент.Значение = 0, "---", ?(Элемент.Значение = 1, "СМС", ?(Элемент.Значение = 2, "Телеграмма", ?(Элемент.Значение = 3, "По электронной почте", "Мессенджер")))));				
			ИначеЕсли Элемент.Представление = "Мессенджер" Тогда    
				Струк.Вставить(ПрефиксСвойства + "Мессенджер", Элемент.Значение);				
			ИначеЕсли Элемент.Представление = "ЗапчастиКлиента" Тогда    
				Струк.Вставить(ПрефиксСвойства + "ЗапчастиКлиента", ?(Элемент.Значение = 0, "---", ?(Элемент.Значение = 1, "Да", "Нет")));
			ИначеЕсли Элемент.Представление = "ЗапасныеЧастиВ_Багажник" Тогда    
				Струк.Вставить(ПрефиксСвойства + "ЗапчастиКлиента", ?(Элемент.Значение = 0, "", ?(Элемент.Значение = 1, "Да", "Нет")));	
			ИначеЕсли Элемент.Представление = "Мобильность" Тогда    
				Струк.Вставить(ПрефиксСвойства + "Мобильность", ?(Элемент.Значение = 0, "Не требуется", ?(Элемент.Значение = 1, "Предложено такси", "Подменный автомобиль")));								
			ИначеЕсли Элемент.Представление = "ПроверкаГБО" Тогда    
				Струк.Вставить(ПрефиксСвойства + "ПроверкаГБО", ?(Элемент.Значение = 0, "НЕТ", ?(Элемент.Значение = 1, "Пустой", "ПОЛНЫЙ")));												
			ИначеЕсли Элемент.Представление = "ЗвонокПоГотовности" Тогда    
				Струк.Вставить(ПрефиксСвойства + "ЗвонокПоГотовности", ?(Элемент.Значение = 0, "НЕТ", ?(Элемент.Значение = 1, "Да", "Нет")));																
			ИначеЕсли Элемент.Представление = "ДатаВремяПромежуточногоЗвонка" Тогда    
				Струк.Вставить(ПрефиксСвойства + "ДатаВремяПромежуточногоЗвонка", Элемент.Значение);																				
			Иначе                                                                                                                         
				Струк.Вставить(ПрефиксСвойства + Элемент.Представление, Элемент.Значение);
			КонецЕсли;    										
		КонецЦикла;			
	КонецЕсли;
	
	#Область УРВ
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФактическоеВремя.Период КАК Начало,
	|	ФактическоеВремя.ДатаОкончания КАК Окончания
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	РегистрСведений.ФактическоеВремя КАК ФактическоеВремя
	|ГДЕ
	|	(ФактическоеВремя.ПакетРабот <> ""
	|			ИЛИ ФактическоеВремя.ПричинаОбращения <> "")
	|	И ФактическоеВремя.ЗаказНаряд = &ДокументСсылка
	|;	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВременнаяТаблица.Начало) КАК ДатаНачалаФакт_ДатаИВремя,
	|	МАКСИМУМ(ВременнаяТаблица1.Окончания) КАК ДатаЗавершенияФакт_ДатаИВремя
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица,
	|	ВременнаяТаблица КАК ВременнаяТаблица1";
	
	Запрос1.Параметры.Вставить("ДокументСсылка",Ссылка);
	РезультатЗапроса1 = Запрос1.Выполнить();
	
	ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();  
	
	ДатаНачалаФакт_ДатаИВремя = Струк[ПрефиксСвойства +"ДатаНачала"];
	ДатаЗавершенияФакт_ДатаИВремя = Струк[ПрефиксСвойства +"ДатаОкончания"];
	
	
	Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл 
		
		если ВыборкаДетальныеЗаписи1.ДатаЗавершенияФакт_ДатаИВремя <> Null тогда 
			ДатаНачалаФакт_ДатаИВремя = ВыборкаДетальныеЗаписи1.ДатаНачалаФакт_ДатаИВремя;  
		КонецЕсли;
		если ВыборкаДетальныеЗаписи1.ДатаЗавершенияФакт_ДатаИВремя <> Null тогда
			ДатаЗавершенияФакт_ДатаИВремя = ВыборкаДетальныеЗаписи1.ДатаЗавершенияФакт_ДатаИВремя;
		КонецЕсли;
		
	КонецЦикла;
	
	Струк.Вставить(ПрефиксСвойства + "ДатаНачалаРаботУРВ",					ДатаНачалаФакт_ДатаИВремя);    
	Струк.Вставить(ПрефиксСвойства + "ДатаНачалаРаботУРВ_ДД_ММ_ГГГГ",		формат(ДатаНачалаФакт_ДатаИВремя,"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ДатаНачалаРаботУРВ_ДатаИВремя",		формат(ДатаНачалаФакт_ДатаИВремя,"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ДатаНачалаРаботУРВ_Время",			формат(ДатаНачалаФакт_ДатаИВремя,"ДФ='HH:mm'"));
	
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончанияРаботУРВ",				ДатаЗавершенияФакт_ДатаИВремя);    
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончанияРаботУРВ_ДД_ММ_ГГГГ",	формат(ДатаЗавершенияФакт_ДатаИВремя,"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончанияРаботУРВ_ДатаИВремя",	формат(ДатаЗавершенияФакт_ДатаИВремя,"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "ДатаОкончанияРаботУРВ_Время",			формат(ДатаЗавершенияФакт_ДатаИВремя,"ДФ='HH:mm'"));
	
	ГарЗаявки = "";
	
	Для Каждого к ИЗ Ссылка.Ауди_ГарантийныеЗаявки Цикл
		ГарЗаявки = ГарЗаявки + ?(ЗначениеЗаполнено(ГарЗаявки), ", ", "") + к.Заявка.Наименование;
	КонецЦикла;
	
	Струк.Вставить("Claim_Номер", ГарЗаявки);
	
	УстановитьПривилегированныйРежим(Ложь);
	#КонецОбласти
	Возврат Струк;	
КонецФункции

Функция		ДоговорАренды_ЗаполнитьСтруктуру(Ссылка, Струк = Неопределено, ПрефиксСвойства = "", Бренд = "") Экспорт
	УстановитьПривилегированныйРежим(Истина);  
	ДатаПечати 					= ТекущаяДата();
	ФорматВыводаСуммы			= УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Ссылка);
	ФорматВыводаКоличества		= УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Ссылка);
	Данные						= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Строка(Ссылка.УникальныйИдентификатор()), "ДопРеквизиты");
	
	ОписаниеНеисправности		= Ссылка.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Описание дефектов (Заказ-наряды)")));
	ОписаниеНеисправности		= ?(ОписаниеНеисправности.Количество() > 0, ОписаниеНеисправности[0].Значение, "");
	
	СтоимостьЗаСутки			= Ссылка.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Стоимость за сутки")));
	СтоимостьЗаСутки			= ?(СтоимостьЗаСутки.Количество() > 0 И СтоимостьЗаСутки[0].Значение > 0, СтрШаблон("%1 (%2)", Формат(СтоимостьЗаСутки[0].Значение, "ЧДЦ=2"), ЧислоПрописью(СтоимостьЗаСутки[0].Значение,"Л = ru_RU; НД = Истина",", , , м, копейка, копейки, копеек, ж, 2")), "бесплатно (бесплатно)");	
	
	Если Струк = Неопределено тогда
		Струк = Новый Структура;
	КонецЕсли;
	
	Организация_ЗаполнитьСтруктуру_Новый	(Ссылка.ПодразделениеКомпании		, Струк);
	Контрагент_ЗаполнитьСтруктуру_Новый		(Ссылка.Заказчик					, Струк, 	"Заказчик_");
	Автомобиль_ЗаполнитьСтруктуру_Новый		(Ссылка.Автомобили[0].Автомобиль	, Струк,	Ссылка.Дата);
	Контрагент_ЗаполнитьСтруктуру_Новый		(Струк.Автомобиль_Владелец			, Струк, 	"Владелец_");
	Сотрудник_ЗаполнитьСтруктуру_Новый		(Ссылка.Автор.Сотрудник				, Струк,	"Автор_");	
	Контрагент_ЗаполнитьСтруктуру_Новый		(Ссылка.Контрагент					, Струк, 	"Контрагент_");                                                                                       
	Контрагент_ЗаполнитьСтруктуру_Новый		(Ссылка.Заказчик					, Струк, 	"КонтактноеЛицо_");
	
	Струк.Вставить(ПрефиксСвойства + "Ссылка"									, Ссылка);	
	Струк.Вставить(ПрефиксСвойства + "Дата"										, Ссылка.Дата);	
	Струк.Вставить(ПрефиксСвойства + "Дата_ДД_ММ_ГГГГ"							, формат(Ссылка.Дата,"ДФ=dd.MM.yyyy"));
	Струк.Вставить(ПрефиксСвойства + "Дата_ДатаИВремя"							, формат(Ссылка.Дата,"ДФ='dd.MM.yyyy HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "Дата_Время"								, формат(Ссылка.Дата,"ДФ='HH:mm'"));
	Струк.Вставить(ПрефиксСвойства + "Валюта"									, Ссылка.ВалютаДокумента);
	Струк.Вставить(ПрефиксСвойства + "Заказчик"									, Ссылка.Заказчик);
	Струк.Вставить(ПрефиксСвойства + "Контрагент"								, Ссылка.Контрагент);
	Струк.Вставить(ПрефиксСвойства + "ИдентификаторГосударственногоКонтракта"	, ?(ЗначениеЗаполнено(Ссылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта),"Идентификатор государственного контракта, договора (соглашения): " + Ссылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта , ""));
	Струк.Вставить("КонтактноеЛицо_ВЛице"										, Струк["Контрагент_ФИО"]);  
	Струк.Вставить("КонтактноеЛицо"												, Ссылка.Заказчик);
	Струк.Вставить("Владелец_ВЛице"												, Струк["Владелец_ФИО"]);
	Струк.Вставить("Заказчик_ВЛице"												, Струк["Заказчик_ФИО"]);	
	Струк.Вставить(ПрефиксСвойства + "Заголовок"								, "№" + Ссылка.Номер + " от " + Формат(Ссылка.Дата, "ДФ=""дд.ММ.гггг"""));
	Струк.Вставить("ДнейАренды"													, (НачалоДня(Ссылка.ДатаОкончания) - НачалоДня(Ссылка.ДатаНачала)) / 86400);	
	Струк.Вставить("ДатаНачала"													, Формат(Ссылка.ДатаНачала		, "ДФ=dd.MM.yyyy"));	
	Струк.Вставить("ДатаОкончания"												, Формат(Ссылка.ДатаОкончания	, "ДФ=dd.MM.yyyy"));	
	Струк.Вставить("ВремяНачала"												, Формат(Ссылка.ДатаНачала		, "ДФ='HH:mm'"));	
	Струк.Вставить("ВремяОкончания"												, Формат(Ссылка.ДатаОкончания	, "ДФ='HH:mm'"));
	Струк.Вставить("СтоимостьЗаСутки"											, СтоимостьЗаСутки);
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Струк;	
КонецФункции


Функция		Организация_ЗаполнитьСтруктуру_Новый(ПодразделениеКомпании,  СтруктураДанных = Неопределено) Экспорт
	Если СтруктураДанных = Неопределено тогда
		СтруктураДанных = Новый Структура;
	конецЕсли;
		
	ФирмаЮрАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ЮрАдресПодразделенияКомпании);  
	
	Если ПустаяСтрока(ФирмаЮрАдрес) Тогда
		ФирмаЮрАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации); 
	конецЕсли; 

	ФирмаФактАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ФактАдресПодразделенияКомпании);
	
	Если ПустаяСтрока(ФирмаФактАдрес) Тогда
		ФирмаФактАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании.Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации); 
	КонецЕсли; 

	ФирмаТел = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ТелефонПодразделенияКомпании);   
	
	//-РАВ 16.09.2024-
	Если ПараметрыСеанса.ТекущийПользователь.ПодразделениеКомпании.Родитель = Справочники.ПодразделенияКомпании.СервисПроспектКонституции35Курган() Тогда
		Если СтруктураДанных.Ссылка.СводныйРемонтныйЗаказ.Автомобиль.Марка = Справочники.Марки.HYUNDAI() Тогда
			ФирмаТел = "+7 (3522) 64-11-33";
		иначе
			ФирмаТел = "+7 (3522) 22-60-60";                                                                		
		КонецЕсли;
	КонецЕсли;
	//-РАВ 16.09.2024-
	
	Если ПустаяСтрока(ФирмаТел) Тогда 
		ФирмаТел = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании.Организация, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации); 
	КонецЕсли;
	
	ФирмаВебСтраницаОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ВебСтраницаПодразделенияКомпании);   
	
	Если ПустаяСтрока(ФирмаВебСтраницаОрганизации) Тогда 
		ФирмаВебСтраницаОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании.Организация, Справочники.ВидыКонтактнойИнформации.ВебСтраницаОрганизации); 
	КонецЕсли;
	
	ФирмаEMail = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.EmailПодразделенияКомпании);   

	Если ПустаяСтрока(ФирмаEMail) Тогда 
		ФирмаEMail = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПодразделениеКомпании.Организация, Справочники.ВидыКонтактнойИнформации.EmailОрганизации); 
	КонецЕсли;
	
	ИНН = ПодразделениеКомпании.Организация.ИНН;
	КПП = ?(ЗначениеЗаполнено(ПодразделениеКомпании.КПП), ПодразделениеКомпании.КПП, ПодразделениеКомпании.Организация.КПП);
	
	Если ЗначениеЗаполнено(КПП) Тогда
		ИНН_КПП = стрШаблон("ИНН %1, КПП %2", ИНН, КПП);
	Иначе
		ИНН_КПП = стрШаблон("ИНН %1", ИНН);		
	КонецЕсли;
		// Для информации выведим данные из регистра.
	УстановитьПривилегированныйРежим(Истина);
	
	// Чтение значения для руководителя
	СтруктураОтбора=Новый Структура("Организация,Объект",ПодразделениеКомпании.Организация,Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(НачалоДня(ТекущаяДатаСеанса()),СтруктураОтбора);
	ОрганизацияРуководитель=СтруктураСведений.Значение;    
	
	СтруктураОтбора=Новый Структура("Организация,Объект",ПодразделениеКомпании,Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(НачалоДня(ТекущаяДатаСеанса()),СтруктураОтбора);
	ПодразделениеКомпанииРуководитель=СтруктураСведений.Значение; 

	Если не ЗначениеЗаполнено(ПодразделениеКомпанииРуководитель) тогда
		ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Руководитель");
		Попытка
			ПодразделениеКомпанииРуководитель=ПодразделениеКомпании.ДополнительныеРеквизиты.Найти(ДопСвойство).Значение;
		Исключение
		конецПопытки;
	КонецЕсли;

	УстановитьПривилегированныйРежим(ложь);
	
	Сотрудник_ЗаполнитьСтруктуру_Новый(ОрганизацияРуководитель,				СтруктураДанных,	"ОрганизацияРуководитель_");
	Сотрудник_ЗаполнитьСтруктуру_Новый(ПодразделениеКомпанииРуководитель,	СтруктураДанных,	"ПодразделениеКомпанииРуководитель_");


	СтруктураДанных.Вставить("Организация_Наименование",		ПодразделениеКомпании.Организация.Наименование);
	СтруктураДанных.Вставить("Организация_НаименованиеПолное",	ПодразделениеКомпании.Организация.НаименованиеПолное);
	СтруктураДанных.Вставить("Организация_ЮрАдрес", 			ФирмаЮрАдрес);
	СтруктураДанных.Вставить("Организация_ФактАдрес", 			ФирмаФактАдрес);
	СтруктураДанных.Вставить("Организация_Телефон", 			ФирмаТел);
	СтруктураДанных.Вставить("Организация_ВебСтраница", 		ФирмаВебСтраницаОрганизации);
	СтруктураДанных.Вставить("Организация_EMail",		 		ФирмаEMail);
	СтруктураДанных.Вставить("Организация_ИНН", 				ИНН);
	СтруктураДанных.Вставить("Организация_КПП", 				КПП);
	СтруктураДанных.Вставить("Организация_ИНН_КПП",				ИНН_КПП);
	СтруктураДанных.Вставить("Организация_ОКПО", 				ПодразделениеКомпании.Организация.КодПоОКПО);
	
	СтруктураДанных.Вставить("Организация_ДоверенноеЛицо", 		"Доверенное Лицо");
	СтруктураДанных.Вставить("Организация_Доверенность", 		"Доверенность");
	
	БанковскийСчет_ЗаполнитьСтруктуру_Новый(ПодразделениеКомпании.Организация,СтруктураДанных,"Организация_");
	БанковскийСчет_ЗаполнитьСтруктуру_Новый(ПодразделениеКомпании,СтруктураДанных,"ПодразделениеКомпании_");
	
	
	Возврат СтруктураДанных;
КонецФункции 

Функция		Автомобиль_ЗаполнитьСтруктуру_Новый(Автомобиль, СтруктураДанных = Неопределено, Дата = '21000101') Экспорт
	Если СтруктураДанных = Неопределено Тогда
		СтруктураДанных = Новый Структура;
	КонецЕсли;
	
	Автомобиль_Владелец = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин, КонецДня(Дата));
	
	Если НЕ ЗначениеЗаполнено(Автомобиль_Владелец) Тогда
		Автомобиль_Владелец = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин, ТекущаяДата());	
	КонецЕсли;
	
	Автомобиль_Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег, КонецДня(Дата));
	Автомобиль_ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер, КонецДня(Дата));
	
	СтруктураДанных.Вставить("Автомобиль",						Автомобиль);
	СтруктураДанных.Вставить("Автомобиль_ГосНомер",				?(ЗначениеЗаполнено(Автомобиль_ГосНомер), Строка(Автомобиль_ГосНомер),""));
	СтруктураДанных.Вставить("Автомобиль_Пробег",				?(ЗначениеЗаполнено(Автомобиль_Пробег), Строка(Автомобиль_Пробег),""));
	СтруктураДанных.Вставить("Автомобиль_Владелец",				?(ЗначениеЗаполнено(Автомобиль_Владелец), Автомобиль_Владелец,""));
	СтруктураДанных.Вставить("Автомобиль_ВладелецНаименование",	?(ЗначениеЗаполнено(Автомобиль_Владелец), строка(Автомобиль_Владелец),""));
	
	Если ЗначениеЗаполнено(Автомобиль_Владелец) тогда 
		Контрагент_ЗаполнитьСтруктуру_Новый(Автомобиль_Владелец, СтруктураДанных, "Автомобиль_Владелец_");
	КонецЕсли;
	
	СтруктураДанных.Вставить("Автомобиль_ДатаНачалаГарантии",	?(ЗначениеЗаполнено(Автомобиль.ДатаНачалаГарантии), Формат(Автомобиль.ДатаНачалаГарантии,"ДЛФ=Д"),""));
	СтруктураДанных.Вставить("Автомобиль_ДатаОкончанияГарантии",?(ЗначениеЗаполнено(Автомобиль.ДатаОкончанияГарантии),Формат(Автомобиль.ДатаОкончанияГарантии,"ДЛФ=Д"),""));
	СтруктураДанных.Вставить("Автомобиль_ГодВыпуска",			СтрЗаменить(Год(Автомобиль.ГодВыпуска), Символы.НПП,""));
	СтруктураДанных.Вставить("Автомобиль_VIN",					Автомобиль.VIN);
	
	Если ЗначениеЗаполнено(Автомобиль.VIN) Тогда
		Для симв = 1 ПО СтрДлина(Автомобиль.VIN) Цикл
			СтруктураДанных.Вставить("Автомобиль_VIN" + Строка(симв),			Сред(Автомобиль.VIN, симв, 1));
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДанных.Вставить("Автомобиль_Марка",				Автомобиль.Марка);
	СтруктураДанных.Вставить("Автомобиль_Модель",				Автомобиль.Модель);
	СтруктураДанных.Вставить("Автомобиль_МодельНаименование",	Автомобиль.Модель.Наименование);
	СтруктураДанных.Вставить("Автомобиль_Двигатель",			Автомобиль.НомерДвигателя);
	СтруктураДанных.Вставить("Автомобиль_ТипДвигателя",			?(ПустаяСтрока(строка(Автомобиль.ТипДвигателя)),строка(Автомобиль.МодельДвигателя),строка(Автомобиль.ТипДвигателя)));
	СтруктураДанных.Вставить("Автомобиль_ТипКузова",			строка(Автомобиль.ТипКузова));
	СтруктураДанных.Вставить("Автомобиль_Цвет",					строка(Автомобиль.Цвет));
	СтруктураДанных.Вставить("Автомобиль_Кузов",				Автомобиль.НомерКузова);
	СтруктураДанных.Вставить("Автомобиль_Шасси",				Автомобиль.НомерШасси);
	
	СвидетельствоОРегистрацииТС = Справочники.ПодтверждающиеДокументы.ПолучитьПодтверждающийДокументОбъектаПоВиду(Автомобиль,Перечисления.ВидыДокументов.СвидетельствоОРегистрацииТС);
	
	Если СвидетельствоОРегистрацииТС <> Справочники.ПодтверждающиеДокументы.ПустаяСсылка() тогда
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_Серия",				СвидетельствоОРегистрацииТС.Серия);
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_ДатаВыдачи",			СвидетельствоОРегистрацииТС.ДатаВыдачи);
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_КемВыдан",			СвидетельствоОРегистрацииТС.КемВыдан);
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_Номер",				СвидетельствоОРегистрацииТС.Номер);
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_ДатаОкончания",		СвидетельствоОРегистрацииТС.ДатаОкончания);
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_КодПодразделения",	СвидетельствоОРегистрацииТС.КодПодразделения);
	иначе
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_Серия",				"");
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_ДатаВыдачи",			"");
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_КемВыдан",			"");
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_Номер",				"");
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_ДатаОкончания",		"");
		СтруктураДанных.Вставить("Автомобиль_Свидетельство_КодПодразделения",	"");
	конецЕсли;
	
	ПТС = Справочники.ПодтверждающиеДокументы.ПолучитьПодтверждающийДокументОбъектаПоВиду(Автомобиль,Перечисления.ВидыДокументов.ПТС);
	Если ПТС <> Справочники.ПодтверждающиеДокументы.ПустаяСсылка() тогда
		СтруктураДанных.Вставить("Автомобиль_ПТС_Серия", 				ПТС.Серия);
		СтруктураДанных.Вставить("Автомобиль_ПТС_ДатаВыдачи", 			ПТС.ДатаВыдачи);
		СтруктураДанных.Вставить("Автомобиль_ПТС_КемВыдан", 			ПТС.КемВыдан);
		СтруктураДанных.Вставить("Автомобиль_ПТС_Номер", 				ПТС.Номер);
		СтруктураДанных.Вставить("Автомобиль_ПТС_ДатаОкончания",		ПТС.ДатаОкончания);
		СтруктураДанных.Вставить("Автомобиль_ПТС_КодПодразделения",		ПТС.КодПодразделения);
	иначе
		СтруктураДанных.Вставить("Автомобиль_ПТС_Серия", 				"");
		СтруктураДанных.Вставить("Автомобиль_ПТС_ДатаВыдачи", 			"");
		СтруктураДанных.Вставить("Автомобиль_ПТС_КемВыдан", 			"");
		СтруктураДанных.Вставить("Автомобиль_ПТС_Номер", 				"");
		СтруктураДанных.Вставить("Автомобиль_ПТС_ДатаОкончания",		"");
		СтруктураДанных.Вставить("Автомобиль_ПТС_КодПодразделения",		"");
	конецЕсли;

	
	Возврат СтруктураДанных;
КонецФункции

Функция		Контрагент_ЗаполнитьСтруктуру_Новый(Знач Контрагент, СтруктураДанных = Неопределено, ПрефиксСвойства = "Контрагент_") Экспорт
	Если СтруктураДанных = Неопределено Тогда
		СтруктураДанных = Новый Структура;
	конецЕсли;
	
	Если ТипЗнч(Контрагент) = тип("СправочникСсылка.Контрагенты") тогда
		ФактАдрес	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		ЮрАдрес 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		
		Если НЕ ЗначениеЗаполнено(ФактАдрес) И ЗначениеЗаполнено(ЮрАдрес) Тогда
			ФактАдрес = ЮрАдрес;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЮрАдрес) И ЗначениеЗаполнено(ФактАдрес) Тогда
			ЮрАдрес = ФактАдрес;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Контрагент.КПП) Тогда
			ИНН_КПП = стрШаблон("ИНН %1, КПП %2", Контрагент.ИНН, Контрагент.КПП);
		ИначеЕсли ЗначениеЗаполнено(Контрагент.ИНН) Тогда
			ИНН_КПП = стрШаблон("ИНН %1", Контрагент.ИНН);
		Иначе
			ИНН_КПП = "";
		КонецЕсли;
		
		СтруктураДанных.Вставить(ПрефиксСвойства + "ОГРН",			Контрагент.ОГРН);
		
		СтруктураДанных.Вставить(ПрефиксСвойства + "Наименование",			Контрагент.Наименование);
		СтруктураДанных.Вставить(ПрефиксСвойства + "НаименованиеПолное",	Контрагент.НаименованиеПолное);    		
		СтруктураДанных.Вставить(ПрефиксСвойства + "ФИО",					?(Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо, ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Контрагент.Наименование), Контрагент.Наименование));
		СтруктураДанных.Вставить(ПрефиксСвойства + "ФактАдрес",				?(ПустаяСтрока(ФактАдрес), ЮрАдрес,		ФактАдрес));
		СтруктураДанных.Вставить(ПрефиксСвойства + "ЮрАдрес",				?(ПустаяСтрока(ЮрАдрес),   ФактАдрес,	ЮрАдрес));
		СтруктураДанных.Вставить(ПрефиксСвойства + "Адрес",					?(ПустаяСтрока(ФактАдрес), ЮрАдрес,		ФактАдрес));
		СтруктураДанных.Вставить(ПрефиксСвойства + "Телефон",				УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
		
		//-РАВ 03.02.2025-
		ЮрГород				= "";
		ФактГород 			= "";
		ЮрАдресБезГорода	= "";
		ФактАдресБезГорода	= "";
				
		Попытка        
			ПолныйАдр 				= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,,Ложь);
			ПолныйАдрПредставление	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
			
			Если ПолныйАдр.Количество() > 0 Тогда
				ЧтениеJSON 			= Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ПолныйАдр[0].Значение);
				СтрукАдреса			= ПрочитатьJSON(ЧтениеJSON,,, ФорматДатыJSON.ISO);
				
				Если СтрукАдреса.Свойство("cityType") Тогда
					ЮрГород				= СтрукАдреса.cityType + " " + СтрукАдреса.city;   
					
					Если СтрукАдреса.Свойство("streetType") Тогда
						ЮрАдресБезГорода	= СтрШаблон("%1 %2, д.%3%4", СтрукАдреса.streetType, СтрукАдреса.street, СтрукАдреса.houseNumber, ?(СтрНайти(ПолныйАдрПредставление, ", кв. ") > 0, Сред(ПолныйАдрПредставление, СтрНайти(ПолныйАдрПредставление, ", кв. ")), ""));
					ИначеЕсли СтрукАдреса.Свойство("territoryType") Тогда
						ЮрАдресБезГорода	= СтрШаблон("%1 %2, д.%3%4", СтрукАдреса.territory, СтрукАдреса.territoryType, СтрукАдреса.houseNumber, ?(СтрНайти(ПолныйАдрПредставление, ", кв. ") > 0, Сред(ПолныйАдрПредставление, СтрНайти(ПолныйАдрПредставление, ", кв. ")), ""));					
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			ПолныйАдр 				= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента,,Ложь);
			ПолныйАдрПредставление	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);

			Если ПолныйАдр.Количество() > 0 Тогда
				ЧтениеJSON 			= Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ПолныйАдр[0].Значение);
				СтрукАдреса			= ПрочитатьJSON(ЧтениеJSON,,, ФорматДатыJSON.ISO);	
				
				Если СтрукАдреса.Свойство("cityType") Тогда
					ФактГород			= СтрукАдреса.cityType + " " + СтрукАдреса.city;   
					
					Если СтрукАдреса.Свойство("streetType") Тогда
						ФактАдресБезГорода	= СтрШаблон("%1 %2, д.%3%4", СтрукАдреса.streetType, СтрукАдреса.street, СтрукАдреса.houseNumber, ?(СтрНайти(ПолныйАдрПредставление, ", кв. ") > 0, Сред(ПолныйАдрПредставление, СтрНайти(ПолныйАдрПредставление, ", кв. ")), ""));
					ИначеЕсли СтрукАдреса.Свойство("territoryType") Тогда
						ФактАдресБезГорода	= СтрШаблон("%1 %2, д.%3%4", СтрукАдреса.territory, СтрукАдреса.territoryType, СтрукАдреса.houseNumber, ?(СтрНайти(ПолныйАдрПредставление, ", кв. ") > 0, Сред(ПолныйАдрПредставление, СтрНайти(ПолныйАдрПредставление, ", кв. ")), ""));					
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ЮрГород) И ЗначениеЗаполнено(ФактГород) Тогда
				ЮрГород = ФактГород;
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ЮрАдресБезГорода) И ЗначениеЗаполнено(ФактАдресБезГорода) Тогда
				ЮрАдресБезГорода = ФактАдресБезГорода;
			КонецЕсли;			
		Исключение                                                                                              
			Ош = ОписаниеОшибки();
		КонецПопытки;
	
		СтруктураДанных.Вставить(ПрефиксСвойства + "ЮрГород"			,	ЮрГород);
		СтруктураДанных.Вставить(ПрефиксСвойства + "ФактГород"			,	ФактГород);
		СтруктураДанных.Вставить(ПрефиксСвойства + "ЮрАдресБезГорода"	,	ЮрАдресБезГорода);
		СтруктураДанных.Вставить(ПрефиксСвойства + "ФактАдресБезГорода"	,	ФактАдресБезГорода);					
		//-РАВ 03.02.2025-
		
		//-РАВ 01.08.2024-   
		Попытка
			Если ПрефиксСвойства = "Заказчик_" И ЗначениеЗаполнено(СтруктураДанных.Ссылка.СводныйРемонтныйЗаказ.АдресЭлектроннойПочты) Тогда
				СтруктураДанных.Вставить(ПрефиксСвойства + "Email",	СокрЛП(СтруктураДанных.Ссылка.СводныйРемонтныйЗаказ.АдресЭлектроннойПочты));
			Иначе
				СтруктураДанных.Вставить(ПрефиксСвойства + "Email",	СокрЛП(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента)));
			КонецЕсли;    
		Исключение
			СтруктураДанных.Вставить(ПрефиксСвойства + "Email",		СокрЛП(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента)));
		КонецПопытки;
		//-РАВ 01.08.2024-
		
		СтруктураДанных.Вставить(ПрефиксСвойства + "Web",					УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ВебСтраницаКонтрагента));
		//СтруктураДанных.Вставить(ПрефиксСвойства + "Мессенджер",			УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.УдалитьМессенджерКонтрагента));
		СтруктураДанных.Вставить(ПрефиксСвойства + "ДругаяИнформация",		УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагента));
		СтруктураДанных.Вставить(ПрефиксСвойства + "ИНН",					Контрагент.ИНН);
		СтруктураДанных.Вставить(ПрефиксСвойства + "КПП",					Контрагент.КПП);
		СтруктураДанных.Вставить(ПрефиксСвойства + "ИНН_КПП",				ИНН_КПП);
		СтруктураДанных.Вставить(ПрефиксСвойства + "ДатаРождения",			?(ЗначениеЗаполнено(Контрагент.ДатаРождения), Контрагент.ДатаРождения, ""));
		СтруктураДанных.Вставить(ПрефиксСвойства + "ФормаСобственности",	Контрагент.ФормаСобственности);
		
		Паспорт = Справочники.ПодтверждающиеДокументы.ПолучитьПодтверждающийДокументОбъектаПоВиду(Контрагент,Перечисления.ВидыДокументов.Паспорт);   
		
		Если Паспорт <> Справочники.ПодтверждающиеДокументы.ПустаяСсылка() тогда
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Серия"					, Паспорт.Серия);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаВыдачи"				, Паспорт.ДатаВыдачи);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаВыдачи_ДД_ММ_ГГГГ"	, формат(Паспорт.ДатаВыдачи, "ДФ=dd.MM.yyyy"));
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КемВыдан"				, Паспорт.КемВыдан);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Номер"					, Паспорт.Номер);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаОкончания"			, Паспорт.ДатаОкончания);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КодПодразделения"		, Паспорт.КодПодразделения);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт"						, СтрШаблон("Серия %1 Номер %2 выдан %3, дата выдачи %4", Паспорт.Серия, Паспорт.Номер, Паспорт.КемВыдан, формат(Паспорт.ДатаВыдачи, "ДФ=dd.MM.yyyy")));
		иначе
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Серия"					, "");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаВыдачи"				, "");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаВыдачи_ДД_ММ_ГГГГ"	, "");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КемВыдан"				, "");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Номер"					, "");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаОкончания"			, "");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КодПодразделения"		, "");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт"						, "");
		конецЕсли;
		
		Доверенность = Справочники.ПодтверждающиеДокументы.ПолучитьПодтверждающийДокументОбъектаПоВиду(Контрагент,Перечисления.ВидыДокументов.Доверенность);
		
		Если (Доверенность <> Справочники.ПодтверждающиеДокументы.ПустаяСсылка() И ((ЗначениеЗаполнено(Доверенность.ДатаОкончания) И СтруктураДанных.Свойство("Ссылка") И Доверенность.ДатаОкончания >= НачалоДня(СтруктураДанных.Ссылка.Дата)) ИЛИ НЕ ЗначениеЗаполнено(Доверенность.ДатаОкончания))) ИЛИ		
		     (Доверенность <> Справочники.ПодтверждающиеДокументы.ПустаяСсылка() И ((ЗначениеЗаполнено(Доверенность.ДатаОкончания) И СтруктураДанных.Свойство("Дата") И Доверенность.ДатаОкончания >= НачалоДня(СтруктураДанных.Дата)) ИЛИ НЕ ЗначениеЗаполнено(Доверенность.ДатаОкончания))) тогда   //-РАВ 26.03.2024-
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаВыдачи",		Формат(Доверенность.ДатаВыдачи, "ДФ=dd.MM.yyyy"));
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_КемВыдан",			Доверенность.КемВыдан);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_Номер",			Доверенность.Номер);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаОкончания",	Доверенность.ДатаОкончания);
		иначе
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаВыдачи",		"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_КемВыдан",			"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_Номер",			"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаОкончания",	"");
		конецЕсли;
		
		БанковскийСчет_ЗаполнитьСтруктуру_Новый(Контрагент, СтруктураДанных, "Контрагент_");
	иначе
		СтруктураДанных.Вставить(ПрефиксСвойства + "Наименование", 		Контрагент);
		СтруктураДанных.Вставить(ПрефиксСвойства + "ФИО", 				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "ФактАдрес",			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "ЮрАдрес",			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Адрес",				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Телефон",			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Email",				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Web",				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Мессенджер",		"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "ДругаяИнформация",	"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "ИНН", 				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "КПП", 				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "ИНН_КПП", 			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "ДатаРождения", 		"");
		
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Серия", 			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаВыдачи", 		"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КемВыдан", 			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Номер", 			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаОкончания",		"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КодПодразделения",	"");
		
		СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаВыдачи", 		"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_КемВыдан", 		"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_Номер", 			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаОкончания",	"");
	конецЕсли;
		
	Возврат СтруктураДанных;
КонецФункции

Функция		Сотрудник_ЗаполнитьСтруктуру_Новый(Знач Сотрудник, СтруктураДанных = Неопределено, ПрефиксСвойства = "") Экспорт
	Если СтруктураДанных = Неопределено Тогда
		СтруктураДанных = Новый Структура;
	конецЕсли;
	
	Если ТипЗнч(Сотрудник) = тип("СправочникСсылка.Сотрудники") тогда 
		ФактАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Сотрудник, Справочники.ВидыКонтактнойИнформации.ФактАдресСотрудника);
		ЮрАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Сотрудник, Справочники.ВидыКонтактнойИнформации.ЮрАдресСотрудника);
		
		Если НЕ ЗначениеЗаполнено(ФактАдрес) И ЗначениеЗаполнено(ЮрАдрес) Тогда
			ФактАдрес = ЮрАдрес;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЮрАдрес) И ЗначениеЗаполнено(ФактАдрес) Тогда
			ЮрАдрес = ФактАдрес;
		КонецЕсли;
		
		СтруктураДанных.Вставить(ПрефиксСвойства + "Наименование",			Сотрудник.Наименование);     
		СтруктураДанных.Вставить(ПрефиксСвойства + "ФИО", 					ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Сотрудник.Наименование));
		СтруктураДанных.Вставить(ПрефиксСвойства + "ФактАдрес",				?(ПустаяСтрока(ФактАдрес), ЮрАдрес, ФактАдрес));
		СтруктураДанных.Вставить(ПрефиксСвойства + "ЮрАдрес",				?(ПустаяСтрока(ЮрАдрес),   ФактАдрес, ЮрАдрес));
		СтруктураДанных.Вставить(ПрефиксСвойства + "Адрес",					?(ПустаяСтрока(ФактАдрес), ЮрАдрес,ФактАдрес));
		СтруктураДанных.Вставить(ПрефиксСвойства + "Телефон",				УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Сотрудник, Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника));
		СтруктураДанных.Вставить(ПрефиксСвойства + "Email",					УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Сотрудник, Справочники.ВидыКонтактнойИнформации.EmailСотрудника));
		СтруктураДанных.Вставить(ПрефиксСвойства + "Web",					УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Сотрудник, Справочники.ВидыКонтактнойИнформации.ВебСтраницаСотрудника));
		//СтруктураДанных.Вставить(ПрефиксСвойства + "Мессенджер",			УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Сотрудник, Справочники.ВидыКонтактнойИнформации.УдалитьМессенджерКонтрагента));
		СтруктураДанных.Вставить(ПрефиксСвойства + "ДругаяИнформация",		УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Сотрудник, Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияСотрудника));
		СтруктураДанных.Вставить(ПрефиксСвойства + "ДатаРождения",			Сотрудник.ДатаРождения);
		
		Паспорт = Справочники.ПодтверждающиеДокументы.ПолучитьПодтверждающийДокументОбъектаПоВиду(Сотрудник,Перечисления.ВидыДокументов.Паспорт);
		
		Если Паспорт <> Справочники.ПодтверждающиеДокументы.ПустаяСсылка() тогда
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Серия",			Паспорт.Серия);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаВыдачи",		Паспорт.ДатаВыдачи);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КемВыдан",			Паспорт.КемВыдан);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Номер",				Паспорт.Номер);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаОкончания",		Паспорт.ДатаОкончания);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КодПодразделения",	Паспорт.КодПодразделения);
		иначе
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Серия",				"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаВыдачи",		"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КемВыдан",			"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Номер",				"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаОкончания",		"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КодПодразделения",	"");
		конецЕсли;
		
		Доверенность  = Справочники.ПодтверждающиеДокументы.ПолучитьПодтверждающийДокументОбъектаПоВиду(Сотрудник,Перечисления.ВидыДокументов.Доверенность);
		
		Если Доверенность <> Справочники.ПодтверждающиеДокументы.ПустаяСсылка() тогда
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаВыдачи",		Доверенность.ДатаВыдачи);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_КемВыдан",			Доверенность.КемВыдан);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_Номер",			Доверенность.Номер);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаОкончания",	Доверенность.ДатаОкончания);
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_Представление",	Доверенность.Наименование);
		иначе
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаВыдачи",		"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_КемВыдан",			"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_Номер",			"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаОкончания",	"");
			СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_Представление",	"");
		конецЕсли;   
		
	иначе       
		СтруктураДанных.Вставить(ПрефиксСвойства + "Наименование",		Сотрудник);
		СтруктураДанных.Вставить(ПрефиксСвойства + "ФИО",				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "ФактАдрес",			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "ЮрАдрес",			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Адрес",				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Телефон",			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Email",				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Web",				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Мессенджер",		"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "ДругаяИнформация",	"");
		
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Серия",				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаВыдачи",		"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КемВыдан",			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_Номер",				"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_ДатаОкончания",		"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Паспорт_КодПодразделения",	"");
		
		СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаВыдачи",		"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_КемВыдан",			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_Номер",			"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_ДатаОкончания",	"");
		СтруктураДанных.Вставить(ПрефиксСвойства + "Доверенность_Представление",	"");
	конецЕсли;
		
	Возврат СтруктураДанных;
КонецФункции

Функция		БанковскийСчет_ЗаполнитьСтруктуру_Новый(Знач Объект, СтруктураДанных = Неопределено, ПрефиксСвойства = "") Экспорт
	Если СтруктураДанных = Неопределено тогда
		СтруктураДанных = Новый Структура;
	конецЕсли;	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации")
		или ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты")
		или ТипЗнч(Объект) = Тип("СправочникСсылка.ПодразделенияКомпании") тогда
		ОсновнойБанковскийСчет = Объект.ОсновнойБанковскийСчет;
	КонецЕсли;
	
	СтруктураДанных.Вставить(ПрефиксСвойства + "НомерСчета", 			ОсновнойБанковскийСчет.НомерСчета); 
	СтруктураДанных.Вставить(ПрефиксСвойства + "КоррСчет", 				ОсновнойБанковскийСчет.Банк.КоррСчет); 
	СтруктураДанных.Вставить(ПрефиксСвойства + "Банк", 					ОсновнойБанковскийСчет.Банк.Наименование); 
	СтруктураДанных.Вставить(ПрефиксСвойства + "Банк_Город", 			ОсновнойБанковскийСчет.Банк.Город); 
	СтруктураДанных.Вставить(ПрефиксСвойства + "Банк_Адрес", 			ОсновнойБанковскийСчет.Банк.Адрес); 
	СтруктураДанных.Вставить(ПрефиксСвойства + "Банк_Телефоны", 		ОсновнойБанковскийСчет.Банк.Телефоны); 
	СтруктураДанных.Вставить(ПрефиксСвойства + "Банк_ИНН", 				ОсновнойБанковскийСчет.Банк.ИНН); 
	СтруктураДанных.Вставить(ПрефиксСвойства + "Банк_СВИФТБИК", 		ОсновнойБанковскийСчет.Банк.СВИФТБИК); 
	СтруктураДанных.Вставить(ПрефиксСвойства + "Банк_БИК", 				ОсновнойБанковскийСчет.Банк.Код); 
	
	СтруктураДанных.Вставить(ПрефиксСвойства + "СчетПредставлениеВСтроку", 	стрШаблон("р/с %1,в банке %2,БИК %3,к/с %4",ОсновнойБанковскийСчет.НомерСчета,ОсновнойБанковскийСчет.Банк.Наименование,ОсновнойБанковскийСчет.Банк.Код,ОсновнойБанковскийСчет.Банк.КоррСчет));
	
	Возврат СтруктураДанных;
КонецФункции 

//		Команад добаляется пример из расширения NISSAN модуль менеджера документа заказ-наряд:
//  
//  	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
//			Неопределено,
//			"ПФ_DOC_ДоговорРассрочкиNISSAN",      					- название макета
//			НСтр("ru = 'NISSAN - Договор рассрочки'"),
//			СсылкаНаДокумент,
//			"СатурнР_ПечатьКлиент.Печать_документа_Word");          - вызывает формирование печати
Функция		МакетыИДанныеОбъектовДляПечати_Word(Знач ИменаМакетов, Знач ДокументыПечати) Экспорт
	МассивИменМакетов = СтрРазделить(ИменаМакетов, ", ", Ложь);
	
	МакетыИДанные = Документы.ЗаказНаряд.СатурнР_ПолучитьДанныеПечати_Word(ДокументыПечати, МассивИменМакетов);
	МакетыИДанные.Вставить("ЛокальныйКаталогФайловПечати", Неопределено); 
	Возврат МакетыИДанные;
КонецФункции

//		Команад добаляется пример из расширения NISSAN модуль менеджера документа заказ-наряд:
//  
//  	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
//			Неопределено,
//			"ПФ_DOC_ДоговорРассрочкиNISSAN",      					- название макета
//			НСтр("ru = 'NISSAN - Договор рассрочки'"),
//			СсылкаНаДокумент,
//			"СатурнР_ПечатьКлиент.Печать_документа_Word");          - вызывает формирование печати
Функция		ПолучитьДанныеОбъектаПечатиДоговорРассрочки_Word(Знач ДокументыПечати) Экспорт
	
	ДанныеПечати = Новый Массив;
	
	Для Каждого Документ Из ДокументыПечати Цикл
		
		СтруктураЗН = ЗаказНаряд_ЗаполнитьСтруктуру_Новый(Документ); 
		СтруктураЗН.Вставить("НомерДок",Документ.Номер);
		СтруктураЗН.Вставить("ДатаДок",Документ.Дата);
		СтруктураЗН.Вставить("ТекущаяДатаФормат1",Формат(ТекущаяДата(),"ДФ='«dd» MMMM yyyy ""г.""'"));   
		СтруктураЗН.Вставить("ТекущееВремяФормат1",Формат(ТекущаяДата(),"ДФ='HH:mm'"));   
		СтруктураЗН.Вставить("РассрочкаМес",2);
		СтруктураЗН.Вставить("ПервоначальныйПлатеж",12);
		СтруктураЗН.Вставить("РазмерПлатежа",20);
		
		
		ДанныеПечати.Добавить(СтруктураЗН);    
		
	КонецЦикла;
	
	Возврат ДанныеПечати;
	
КонецФункции

Функция		ПолучитьЛоготипМарки_АдресКартинки(Знач Марка) Экспорт
	КартинкаЛоготип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Марка, "Логотип");
	АдресКартинки = ПоместитьВоВременноеХранилище(КартинкаЛоготип.Получить());
	Возврат АдресКартинки;
конецФункции

Процедура	КартинкуЛоготипаМаркиВТабличныйДокумент(ТабличныйДокумент, Знач Марка, Знач ИмяКартинки="ЛоготипМарки")Экспорт
	Попытка
		Для Каждого Рисунок Из ТабличныйДокумент.Рисунки Цикл
			Если Рисунок.Имя = ИмяКартинки Тогда
				ЛоготипХЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Марка, "Логотип");
				Рисунок.Картинка = Новый Картинка(ЛоготипХЗ.Получить());
			КонецЕсли;
		КонецЦикла;
	Исключение  
		Ош = ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры

//--------------------------------------------
// Для создания колонтитулов

// Функция вывода в табличный документ колонтитулов и повторения шапки таблицы.
//
// Параметры:
//  ТабДок - ТабличныйДокумент - Итоговый табличный документ (размеры должны быть заданы заранее).
//  ВыводимаяОбласть - ОбластьТабличногоДокумента - Текущая выводимая область.
//  ОбластьПустойСтроки	 - ОбластьТабличногоДокумента - Область с пустой строкой.
//  ОбластьВерхнегоКолонтитула - ОбластьТабличногоДокумента - Необязательный, 
//    область с верхним колонтитулом.
//  ОбластьНижнегоКолонтитула - ОбластьТабличногоДокумента - Необязательный, 
//    область с нижним колонтитулом.
//  ОбластьШапкаТаблицы - ОбластьТабличногоДокумента - Необязательный, 
//    область шапки текущей выводимой таблицы.
//  НомерСтраницы - Число - Необязательный, номер страницы 
//   (по умолчанию добавляется на нижний колонтитул).
// 
// Возвращаемое значение:
//  Число - текущий номер страницы.
//
Функция 	ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ВыводимаяОбласть,ОбластьПустойСтроки,ОбластьВерхнегоКолонтитула = Неопределено, ОбластьНижнегоКолонтитула = Неопределено,ОбластьШапкаТаблицы = Неопределено,НомерСтраницы = 0, Колонтитул = ложь, НачатьСНовойСтраницы = ложь)Экспорт

	Если не Колонтитул тогда 
		Если ВыводимаяОбласть <> Неопределено Тогда
			ТабличныйДокумент.Вывести(ВыводимаяОбласть);   
		КонецЕсли;
		
		возврат 0; 
	конецЕсли; 
	ЗапретВисячихШапокТаблицы = Истина;
	
	// Проверка наличия областей.
	ЕстьВыводимаяОбласть = не ВыводимаяОбласть = Неопределено;
	ЕстьВерхнийКолонтитул = не ОбластьВерхнегоКолонтитула = Неопределено;
	ЕстьНижнийКолонтитул = не ОбластьНижнегоКолонтитула = Неопределено;
	ЕстьШапкаТаблицы = не ОбластьШапкаТаблицы = Неопределено;
	
	// Проверка, является ли эта итерация функции выводом шапки таблицы.
	ЭтоВыводШапкиТаблицы = (ЕстьШапкаТаблицы И ВыводимаяОбласть = ОбластьШапкаТаблицы);
	
	// Формирование области с нижним колонтитулом.
	ОбластьСНижнимКолонтитулом = Новый Массив;
	ОбластьСНижнимКолонтитулом.Добавить(?(ЕстьВыводимаяОбласть, ВыводимаяОбласть, ОбластьПустойСтроки));
	
	// Если параметр задан, то добавляем к шапке пустую строку для дальнейшей проверки.
	Если ЗапретВисячихШапокТаблицы Тогда
		Если ЭтоВыводШапкиТаблицы Тогда
			ОбластьСНижнимКолонтитулом.Добавить(ОбластьПустойСтроки);
		КонецЕсли;
	КонецЕсли;
	
	// Добавлем непосредственно сам нижний колонтитул в формируемую область нижнего колонтитула.
	Если ЕстьНижнийКолонтитул Тогда
		ОбластьСНижнимКолонтитулом.Добавить(ОбластьНижнегоКолонтитула);
	КонецЕсли;
	
	Если ВыводимаяОбласть = Неопределено И ЕстьНижнийКолонтитул Тогда   				// Добавляем в конце всего документа нижний колонтитул 
		Пока ТабличныйДокумент.ПроверитьВывод(ОбластьСНижнимКолонтитулом) Цикл
			ТабличныйДокумент.Вывести(ОбластьПустойСтроки);
		КонецЦикла;
		// Добавляем номер страницы в нижний колонтитул, если их более одной.
		//Если НомерСтраницы > 1 Тогда
			Попытка
				ОбластьНижнегоКолонтитула.Параметры.НомерСтраницы = НомерСтраницы;
			исключение
			КонецПопытки;
		//КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьНижнегоКолонтитула);
	ИначеЕсли ВыводимаяОбласть = ОбластьПустойСтроки И ЕстьНижнийКолонтитул Тогда		// Добавляем пустые строки, когда требуется вставить нижний и верхний колонтитул  
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьСНижнимКолонтитулом) Тогда
			Возврат НомерСтраницы;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ВыводимаяОбласть);
		НомерСтраницы = ВыводВТабДокСКолонтитулами(ТабличныйДокумент,
			ОбластьПустойСтроки,
			ОбластьПустойСтроки,
			ОбластьВерхнегоКолонтитула,
			ОбластьНижнегоКолонтитула,
			ОбластьШапкаТаблицы,
			НомерСтраницы,
			Колонтитул); 	
	Иначе                                                                          		// проверка потребности вставить колонтитулы
		Если (ЕстьНижнийКолонтитул и Не ТабличныйДокумент.ПроверитьВывод(ОбластьСНижнимКолонтитулом)) или НачатьСНовойСтраницы Тогда
			Если ОбластьПустойСтроки <> Неопределено Тогда
				НомерСтраницы = ВыводВТабДокСКолонтитулами(ТабличныйДокумент,
				ОбластьПустойСтроки,
				ОбластьПустойСтроки,
				ОбластьВерхнегоКолонтитула,
				ОбластьНижнегоКолонтитула,
				ОбластьШапкаТаблицы,
				НомерСтраницы,
				Колонтитул);
			КонецЕсли;
			// Вывод нижнего колонтитула.
			Если ЕстьНижнийКолонтитул Тогда
				Если НомерСтраницы > 0 Тогда
					Попытка
						ОбластьНижнегоКолонтитула.Параметры.НомерСтраницы = НомерСтраницы;  
					исключение
					КонецПопытки;
					НомерСтраницы = НомерСтраницы + 1;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьНижнегоКолонтитула);
			КонецЕсли;
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			// Вывод верхнего колонтитула.
			Если ЕстьВерхнийКолонтитул Тогда
				ТабличныйДокумент.Вывести(ОбластьВерхнегоКолонтитула);
			КонецЕсли;
			// Повтор шапки таблицы на новой странице.
			Если ЕстьШапкаТаблицы и Не ЭтоВыводШапкиТаблицы Тогда
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			КонецЕсли;
		КонецЕсли;
		// Вывод основных данных в документ.
		ТабличныйДокумент.Вывести(ВыводимаяОбласть);				
	КонецЕсли;
	Возврат НомерСтраницы;
КонецФункции

//--------------------------------------------
// Заполнение  ТабличныйДокумент


// Заполняет  ТабличныйДокумент
// ----------------------
// Обасти макета:
// - Шапка или Шапка1
// -----
// - ПричинаОбращения			- Если существует, то табличные части работ и товаров распределяются по причинам
// - ПобвалПричинаОбращения 
// -----
// - ШапкаРаботы
// - СтрокаРабот
// - СтрокаРабот2
// - ПодвалРаботы 
// -----
// - Шапка2
// -----
// - ШапкаТовары
// - СтрокаТоваров
// - ПодвалТовары
// -----
// - СтрокаМеханики 
// - ПодвалДокумента_ + символ
// - ОборотнаяСторона_ + символ - эти области печатаются с новой страницы
// -----
// - НижнийКолонтитул			- Если существует "НижнийКолонтитул" и "ОбластьПустойСтроки" помещаются в низу каждой страницы 
// - ОбластьПустойСтроки
Функция 	ЗаполнитьТабличныйДокумент_ЗаказНаряд_Базовый(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ИмяМакета, КоллекцияПечатныхФорм)Экспорт	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = ИмяМакета;
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказНаряд_" + ИмяМакета;
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати, ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказНаряд." + ИмяМакета);
	
	ЭтоНеПервыйДокумент = ложь;  
	
	//-РАВ 20.01.2025-
	Если ПараметрыПечати.Свойство("НомерРасширения") Тогда 
		НомерРасширения = ПараметрыПечати.НомерРасширения;
	Иначе
		НомерРасширения = 0;
	КонецЕсли;        
	//-РАВ 20.01.2025-
	
	Для каждого ЗаказНарядаДокумент из МассивОбъектов Цикл	 
		Если ИмяМакета = "ПФ_MXL_ЗаявкаНаРемонт_JLR" И НЕ ЗначениеЗаполнено(ЗаказНарядаДокумент.ПлановаяДатаВыдачи) Тогда
			ВывестиСообщение("НЕ ЗАПОЛНЕН реквизит 'Выдача (план)' (Плановая дата выдачи автомобиля) !!!");             
			
			Возврат Новый ТабличныйДокумент;
		КонецЕсли;
		
		Если ЭтоНеПервыйДокумент тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		СтруктураЗН = ЗаказНаряд_ЗаполнитьСтруктуру_Новый(ЗаказНарядаДокумент);
		СтруктураЗН.Вставить("Ссылка", ЗаказНарядаДокумент);
		
		//-РАВ 10.12.2024-
		Попытка
			Если (ЗначениеЗаполнено(СтруктураЗН.Автомобиль_Пробег) И Число(СтруктураЗН.Автомобиль_Пробег) < СтруктураЗН.ЗН_Пробег) ИЛИ НЕ ЗначениеЗаполнено(СтруктураЗН.Автомобиль_Пробег) Тогда
				СтруктураЗН.Вставить("Автомобиль_Пробег", Строка(СтруктураЗН.ЗН_Пробег));
			КонецЕсли;
		Исключение
		КонецПопытки;
		//-РАВ 10.12.2024-
		
		Если ЗаказНарядаДокумент.Контрагент <> ЗаказНарядаДокумент.СводныйРемонтныйЗаказ.Заказчик Тогда
			СтруктураЗН.Вставить("ДоверенноеЛицо", СтруктураЗН.Заказчик_ФИО); 
			СтруктураЗН.Вставить("Доверенность", "№" + СтруктураЗН.Заказчик_Доверенность_Номер + " от " + СтруктураЗН.Заказчик_Доверенность_ДатаВыдачи );
			СтруктураЗН.Вставить("КонтактныеТелефоны", СтруктураЗН.Заказчик_Телефон);
		Иначе
			СтруктураЗН.Вставить("ДоверенноеЛицо", "----------");
			СтруктураЗН.Вставить("Доверенность", "----------");
			СтруктураЗН.Вставить("КонтактныеТелефоны", "----------");
		КонецЕсли;        
	
		Если ЗаказНарядаДокумент.Контрагент.ФормаСобственности= Перечисления.ФормыСобственности.ЧастноеЛицо тогда
			СтруктураЗН.Вставить("ЗаконОЗащитеПрав", "Согласно ст. 18, 20 Закона РФ ""О защите прав потребителей"" срок устранения производственных недостатков товара, определяемый в письменной форме соглашением сторон, составляет 45 дней. Стороны пришли к соглашению: В случае, если потребитель прервал срок устранения недостатка путем отказа от безвозмездного устранения недостатков или забрал автомобиль из сервиса, сторонами (потребителем и производителем, импортером, продавцом, уполномоченной организацией) признается, что течение 45-дневного срока не началось.");
		иначе
			СтруктураЗН.Вставить("ЗаконОЗащитеПрав", "");
		КонецЕсли;
		
		РазбитПоПричинам 	= Ложь;
		Колонтитул 			= Ложь;
		ЭтоНеПервыйДокумент = истина;
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		
		//-РАВ 20.01.2025- 
		Если ИмяМакета = "ПФ_MXL_ЗаказНаряд_НОВАЯ_КУЗОВНОЙ_2020_JLR" Тогда
			Если НомерРасширения > 0 Тогда
				ТаблицаПричинОбращения 		= ЗаказНарядаДокумент.ПричиныОбращения.Выгрузить();                                    
				НайденныеПричиныОбращения	= ТаблицаПричинОбращения.НайтиСтроки(Новый Структура("НомерРасширения", НомерРасширения));  
				ПричиныИАвтоработы 			= ПричиныОбращенийСлужебный.СоставПричинОбращенийПоЗаказНаряду(ЗаказНарядаДокумент);
				СтруктураЗН.Вставить("Заголовок", СтрШаблон("Расширение %1 №%2", НомерРасширения, СтруктураЗН.Номер));
			Иначе
				НайденныеПричиныОбращения	= Новый Массив;
				СтруктураЗН.Вставить("Заголовок", СтрШаблон("Заказ-Наряд №%1 от %2", СтруктураЗН.Номер, СтруктураЗН.Дата_ДД_ММ_ГГГГ));
			КонецЕсли; 
		Иначе
			НайденныеПричиныОбращения	= Новый Массив;
			СтруктураЗН.Вставить("Заголовок", СтрШаблон("Заказ-Наряд №%1 от %2", СтруктураЗН.Номер, СтруктураЗН.Дата_ДД_ММ_ГГГГ));
		КонецЕсли;
		//-РАВ 20.01.2025-
		
		//-РАВ 01.09.2025-
		Если ИмяМакета = "ПФ_MXL_ЗаказНарядMOTO" ИЛИ ИмяМакета = "ПФ_MXL_АктСдачиПриёмкиВыполненныхРаботMOTO" Тогда
			СтруктураЗН.Вставить("ГарантийнаяЗаявка", ?(ЗаказНарядаДокумент.Ауди_ГарантийныеЗаявки.Количество() > 0, "Гарантийная заявка №" + ЗаказНарядаДокумент.Ауди_ГарантийныеЗаявки[0].Заявка.Наименование, ""));
		КонецЕсли;
		//-РАВ 01.09.2025-
		
		Страница1_ОбластьМакета									= Неопределено;
		Страница2_ОбластьМакета									= Неопределено;
		Страница3_ОбластьМакета									= Неопределено;
		Причина_ОбластьМакета									= Неопределено;
		ПричинаПобвал_ОбластьМакета								= Неопределено;
		ШапкаПричинаОбращенияОтдельнойТаблицей_ОбластьМакета	= Неопределено;
		ПричинаОбращенияОтдельнойТаблицей_ОбластьМакета			= Неопределено;
		ШапкаРаботы_ОбластьМакета								= Неопределено;
		СтрокаРабот_ОбластьМакета								= Неопределено;
		СтрокаРабот2_ОбластьМакета								= Неопределено;
		ПодвалТаблицыРабот_ОбластьМакета						= Неопределено;
		Вторая_ОбластьМакета									= Неопределено;
		ШапкаТовары_ОбластьМакета								= Неопределено;
		СтрокаТоваров_ОбластьМакета								= Неопределено;
		ПодвалТаблицыТоваров_ОбластьМакета						= Неопределено;
		Третья_ОбластьМакета									= Неопределено;
		ШапкаМатериалыЗаказчика_ОбластьМакета					= Неопределено;
		СтрокаМатериалыЗаказчика_ОбластьМакета					= Неопределено;
		ПодвалТаблицыМатериалыЗаказчика_ОбластьМакета			= Неопределено;
		СтрокаМеханики_ОбластьМакета							= Неопределено;
		ВерхнийКолонтитул_ОбластьМакета							= Неопределено;
		НижнийКолонтитул_ОбластьМакета							= Неопределено;
		ОбластьПустойСтроки										= Неопределено;
		
		Шапка_ОбластьМакета					= получитьОбласть(Макет,"Шапка");
		
		Если Шапка_ОбластьМакета = Неопределено тогда  
			Шапка_ОбластьМакета				= получитьОбласть(Макет,"Шапка1");
		конецЕсли;  

		Попытка
			Страница1_ОбластьМакета 				= получитьОбласть(Макет, "Страница1");
		Исключение
		КонецПопытки;

		Попытка
			Страница2_ОбластьМакета 				= получитьОбласть(Макет, "Страница2");
		Исключение
		КонецПопытки;

		Попытка
			Страница3_ОбластьМакета 				= получитьОбласть(Макет, "Страница3");
		Исключение
		КонецПопытки;
		
		Попытка
			Причина_ОбластьМакета 				= получитьОбласть(Макет,"ПричинаОбращения");
		Исключение
		КонецПопытки;
		
		Попытка
			ПричинаПобвал_ОбластьМакета 		= получитьОбласть(Макет,"ПобвалПричинаОбращения");
		Исключение
		КонецПопытки;
		
		Попытка
			ШапкаПричинаОбращенияОтдельнойТаблицей_ОбластьМакета	= получитьОбласть(Макет,"ШапкаПричинаОбращенияОтдельнойТаблицей");
		Исключение
		КонецПопытки;
		
		Попытка
			ПричинаОбращенияОтдельнойТаблицей_ОбластьМакета			= получитьОбласть(Макет,"ПричинаОбращенияОтдельнойТаблицей");
		Исключение
		КонецПопытки;
		
		Попытка
			ШапкаРаботы_ОбластьМакета			= получитьОбласть(Макет,"ШапкаРаботы");
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаРабот_ОбластьМакета			= получитьОбласть(Макет,"СтрокаРабот");
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаРабот2_ОбластьМакета			= получитьОбласть(Макет,"СтрокаРабот2");
		Исключение
		КонецПопытки;
		
		Попытка
			ПодвалТаблицыРабот_ОбластьМакета	= получитьОбласть(Макет,"ПодвалРаботы");
		Исключение
		КонецПопытки;
		
		Попытка
			Вторая_ОбластьМакета				= получитьОбласть(Макет,"Шапка2");
		Исключение
		КонецПопытки;
		
		Попытка
			ШапкаТовары_ОбластьМакета			= получитьОбласть(Макет,"ШапкаТовары");
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаТоваров_ОбластьМакета			= получитьОбласть(Макет,"СтрокаТоваров");
		Исключение
		КонецПопытки;
		
		Попытка
			ПодвалТаблицыТоваров_ОбластьМакета	= получитьОбласть(Макет,"ПодвалТовары");
		Исключение
		КонецПопытки;
		
		Попытка
			Третья_ОбластьМакета							= получитьОбласть(Макет,"Шапка3");
		Исключение
		КонецПопытки;
		
		Попытка
			ШапкаМатериалыЗаказчика_ОбластьМакета			= получитьОбласть(Макет,"ШапкаМатериалыЗаказчика");
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаМатериалыЗаказчика_ОбластьМакета			= получитьОбласть(Макет,"СтрокаМатериалыЗаказчика");
		Исключение
		КонецПопытки;
		
		Попытка
			ПодвалТаблицыМатериалыЗаказчика_ОбластьМакета	= получитьОбласть(Макет,"ПодвалМатериалыЗаказчика");
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаМеханики_ОбластьМакета		= получитьОбласть(Макет,"СтрокаМеханики");
		Исключение
		КонецПопытки;
		
		Попытка
			ВерхнийКолонтитул_ОбластьМакета		= получитьОбласть(Макет,"ВерхнийКолонтитул");
		Исключение
		КонецПопытки;
		
		Попытка
			НижнийКолонтитул_ОбластьМакета		= получитьОбласть(Макет,"НижнийКолонтитул");
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьПустойСтроки					= получитьОбласть(Макет,"ОбластьПустойСтроки");
		Исключение
		КонецПопытки;

		НомерСтраницы = 1; 
		
		Если НижнийКолонтитул_ОбластьМакета <> Неопределено тогда 
			НижнийКолонтитул_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
			Колонтитул = истина;
		конецЕсли;

		Если ПараметрыПечати.Свойство("Булево_ВыводитьАртикул") Тогда
			ВыводитьАртикул = ПараметрыПечати.Булево_ВыводитьАртикул;
		иначе
			ВыводитьАртикул = Истина;
		КонецЕсли;
		
		Если Страница1_ОбластьМакета <> Неопределено Тогда
			Страница1_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
			ТабличныйДокумент.Вывести(Страница1_ОбластьМакета);
			
			Если Страница2_ОбластьМакета <> Неопределено Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				Страница2_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
				ТабличныйДокумент.Вывести(Страница2_ОбластьМакета);
			КонецЕсли;

			Если Страница3_ОбластьМакета <> Неопределено Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				Страница3_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
				ТабличныйДокумент.Вывести(Страница3_ОбластьМакета);
			КонецЕсли;			
			
			Если ИмяМакета = "ПФ_MXL_ЧекЛистППП_MOSKVICH" Тогда
				ТабличныйДокумент.НижнийКолонтитул.Выводить 			= Истина;
				ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница	= 1;
				ТабличныйДокумент.НижнийКолонтитул.ТекстСлева			= "Версия документа 23/01/2025";
				ТабличныйДокумент.НижнийКолонтитул.ТекстСправа			= "Стр.[&НомерСтраницы] из [&СтраницВсего]";
			КонецЕсли;			
		КонецЕсли;
		
		#Область Заполненяем_ТабличныйДокумент
		Если Шапка_ОбластьМакета <> Неопределено Тогда
			Шапка_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
			
			//-РАВ 30.11.2023-
			Если ra_ОбщийМодульНаСервере.РасширениеДоступно("JLR") Тогда
				Если СтруктураЗН.ВидРемонта = Справочники.ВидыРемонта.СервисныйКонтрактТО() Тогда
					Попытка
						Шапка_ОбластьМакета.Параметры.ТипРемонта = "Сервисный пакет";
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЕсли; 
			//-РАВ 30.11.2023-
			
			Если ВерхнийКолонтитул_ОбластьМакета <> Неопределено тогда 
				ВерхнийКолонтитул_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
				Колонтитул = истина;
				ТабличныйДокумент.Вывести(ВерхнийКолонтитул_ОбластьМакета);
			конецЕсли;
			
			ТабличныйДокумент.Вывести(Шапка_ОбластьМакета);
		КонецЕсли;
		
		ТабличныйДокумент.АвтоМасштаб = истина;
		
		Если Причина_ОбластьМакета <> Неопределено тогда
			Для каждого причина из ЗаказНарядаДокумент.ПричиныОбращения Цикл  
				//-РАВ 20.01.2025-
				Если НайденныеПричиныОбращения.Количество() > 0 Тогда
					Если НайденныеПричиныОбращения[0].ИдентификаторПричиныОбращения <> причина.ИдентификаторПричиныОбращения Тогда
						Продолжить;
					Иначе
						СтруктураЗН.Вставить("СуммаДокумента_2"	, 0);
						СтруктураЗН.Вставить("СуммаСкидкиНаценки_2", 0);
						СтруктураЗН.Вставить("СуммаНДС_2"			, 0);
					КонецЕсли;
				КонецЕсли;
				//-РАВ 20.01.2025-
				
				РазбитПоПричинам = Истина;
				
				ДанныеДляЗаполнения = новый структура("Ном,ОписаниеПричины,Артикул,ОписаниеПричиныCRM"
				,причина.НомерСтроки
				,причина.ПричинаОбращенияСодержание
				,?(ЗначениеЗаполнено(причина.ПричинаОбращения.Артикул), причина.ПричинаОбращения.Артикул, СокрЛП(причина.ПричинаОбращения.Код))
				,причина.ПричинаОбращения.Наименование);
				
				#Область Расчет_суммы_причины_обращения
				ДанныеДляЗаполнения.Вставить("СуммаРаботПоПричине",0);
				ДанныеДляЗаполнения.Вставить("ИтогНормВремени",0);
				ДанныеДляЗаполнения.Вставить("СкидкаПричиныРабот",0);
				ДанныеДляЗаполнения.Вставить("СкидкаПричиныТовары",0);
				ДанныеДляЗаполнения.Вставить("СуммаТоварыПоПричине",0);
				ТЗ = ПричиныОбращенийСлужебный.АвтоработыПричиныОбращения(причина.ИдентификаторПричиныОбращения);
				естьРаботыУПО = ложь;
				естьТоварыУПО = ложь;
				
				Для Каждого раб ИЗ ЗаказНарядаДокумент.АвтоРаботы Цикл 
					Если ТЗ.Найти(раб.ИдентификаторРаботы) <> Неопределено тогда
						ДанныеДляЗаполнения.Вставить("КоличествоСтрокРабот",раб.НомерСтроки);
						ДанныеДляЗаполнения.Вставить("ИтогНормВремени",ДанныеДляЗаполнения.ИтогНормВремени + раб.Коэффициент * раб.Количество);
						ДанныеДляЗаполнения.Вставить("СкидкаПричиныРабот",ДанныеДляЗаполнения.СкидкаПричиныРабот + раб.СуммаСкидки + раб.СуммаСкидкиСтроки);
						ДанныеДляЗаполнения.Вставить("СуммаРаботПоПричине",ДанныеДляЗаполнения.СуммаРаботПоПричине + раб.СуммаВсего);
						естьРаботыУПО = истина;    
						
						//-РАВ 20.01.2025-
						Если НайденныеПричиныОбращения.Количество() > 0 Тогда
							СтруктураЗН.Вставить("СуммаДокумента_2"		, СтруктураЗН.СуммаДокумента_2 + раб.СуммаВсего);
							СтруктураЗН.Вставить("СуммаСкидкиНаценки_2"	, СтруктураЗН.СуммаСкидкиНаценки_2 + раб.СуммаСкидки + раб.СуммаСкидкиСтроки);
							СтруктураЗН.Вставить("СуммаНДС_2"			, СтруктураЗН.СуммаНДС_2 + раб.СуммаНДС);	
						КонецЕсли;
						//-РАВ 20.01.2025-
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого тов ИЗ ЗаказНарядаДокумент.Товары Цикл
					Если тов.ИдентификаторПричиныОбращения = причина.ИдентификаторПричиныОбращения тогда
						ДанныеДляЗаполнения.Вставить("КоличествоСтрокТоваров",тов.НомерСтроки);
						ДанныеДляЗаполнения.Вставить("СуммаТоварыПоПричине",ДанныеДляЗаполнения.СуммаТоварыПоПричине + тов.СуммаВсего); 
						ДанныеДляЗаполнения.Вставить("СкидкаПричиныТовары",ДанныеДляЗаполнения.СкидкаПричиныТовары + тов.СуммаСкидки + тов.СуммаСкидкиСтроки);
						естьТоварыУПО = истина;        
						
						//-РАВ 20.01.2025-
						Если НайденныеПричиныОбращения.Количество() > 0 Тогда
							СтруктураЗН.Вставить("СуммаДокумента_2"		, СтруктураЗН.СуммаДокумента_2 + тов.СуммаВсего);
							СтруктураЗН.Вставить("СуммаСкидкиНаценки_2"	, СтруктураЗН.СуммаСкидкиНаценки_2 + тов.СуммаСкидки + тов.СуммаСкидкиСтроки);
							СтруктураЗН.Вставить("СуммаНДС_2"			, СтруктураЗН.СуммаНДС_2 + тов.СуммаНДС);	
						КонецЕсли;
						//-РАВ 20.01.2025-						
					КонецЕсли;
				КонецЦикла;
				
				ДанныеДляЗаполнения.Вставить("СкидкаПричины",ДанныеДляЗаполнения.СкидкаПричиныРабот + ДанныеДляЗаполнения.СкидкаПричиныТовары);
				ДанныеДляЗаполнения.Вставить("СуммаПричины",ДанныеДляЗаполнения.СуммаТоварыПоПричине + ДанныеДляЗаполнения.СуммаРаботПоПричине);
				#КонецОбласти
				
				Причина_ОбластьМакета.Параметры.Заполнить(ДанныеДляЗаполнения);
				НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,Причина_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул); 
				
				ТипРемонта = ?(причина.ВидРемонтаПричиныОбращения = Справочники.ВидыРемонта.ПолучитьСсылку(новый УникальныйИдентификатор("4c571835-70d4-11ed-bcf9-00155d4d9401")),"Г","К");
				
				#Область Работы_для_причины		
				Если естьРаботыУПО тогда
					Если ШапкаРаботы_ОбластьМакета <> Неопределено тогда
						ШапкаРаботы_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
						ШапкаРаботы_ОбластьМакета.Параметры.Заполнить(ДанныеДляЗаполнения);
						НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ШапкаРаботы_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул); 
					КонецЕсли;
					
					Если СтрокаРабот_ОбластьМакета <> Неопределено тогда
						Для Каждого раб ИЗ ЗаказНарядаДокумент.АвтоРаботы Цикл 
							Если ТЗ.Найти(раб.ИдентификаторРаботы) <> Неопределено тогда
								ДобавитьРаботуВТД(раб,СтрокаРабот_ОбластьМакета,ТабличныйДокумент,ЗаказНарядаДокумент,ТипРемонта,ОбластьПустойСтроки,,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);		
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					Если ПодвалТаблицыРабот_ОбластьМакета <> Неопределено тогда
						ПодвалТаблицыРабот_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
						ПодвалТаблицыРабот_ОбластьМакета.Параметры.Заполнить(ДанныеДляЗаполнения);
						НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ПодвалТаблицыРабот_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул); 
					КонецЕсли;
				КонецЕсли;
				#КонецОбласти
				
				#Область Товары_для_причины
				Если естьТоварыУПО тогда
					Если ШапкаТовары_ОбластьМакета <> Неопределено тогда
						ШапкаТовары_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
						ШапкаТовары_ОбластьМакета.Параметры.Заполнить(ДанныеДляЗаполнения);
						НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ШапкаТовары_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
					КонецЕсли;
					
					Если СтрокаТоваров_ОбластьМакета <> Неопределено тогда
						Для Каждого тов ИЗ ЗаказНарядаДокумент.Товары Цикл
							Если тов.ИдентификаторПричиныОбращения = причина.ИдентификаторПричиныОбращения тогда
								ДобавитьТоварВТД(тов,СтрокаТоваров_ОбластьМакета,ТабличныйДокумент,ЗаказНарядаДокумент,ТипРемонта,ВыводитьАртикул,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					Если ПодвалТаблицыТоваров_ОбластьМакета <> Неопределено тогда
						ПодвалТаблицыТоваров_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
						ПодвалТаблицыТоваров_ОбластьМакета.Параметры.Заполнить(ДанныеДляЗаполнения);
						НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ПодвалТаблицыТоваров_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул); 
					КонецЕсли;
				КонецЕсли;
				#КонецОбласти
				
				Если ПричинаПобвал_ОбластьМакета <> Неопределено тогда
					ПричинаПобвал_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
					ПричинаПобвал_ОбластьМакета.Параметры.Заполнить(ДанныеДляЗаполнения);
					НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ПричинаПобвал_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
				КонецЕсли;
			КонецЦикла;
			
			Если не РазбитПоПричинам тогда
				ДанныеДляЗаполнения = новый структура("Ном,ОписаниеПричины,Заключение",1,СтруктураЗН.Причина,ЗаказНарядаДокумент.Рекомендации);
				
				Причина_ОбластьМакета.Параметры.Заполнить(ДанныеДляЗаполнения);
				НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,Причина_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
			КонецЕсли;
		КонецЕсли;
		
		Если не РазбитПоПричинам тогда
			
			Если ЗаказНарядаДокумент.ПричиныОбращения.Количество()>0 тогда
				Если ШапкаПричинаОбращенияОтдельнойТаблицей_ОбластьМакета <> Неопределено тогда 
					ШапкаПричинаОбращенияОтдельнойТаблицей_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
					НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ШапкаПричинаОбращенияОтдельнойТаблицей_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
				конецЕсли;
				Если ПричинаОбращенияОтдельнойТаблицей_ОбластьМакета  <> Неопределено тогда
					Для каждого причина из ЗаказНарядаДокумент.ПричиныОбращения Цикл
						ДанныеДляЗаполнения = новый структура("Ном,ОписаниеПричины,Артикул,ОписаниеПричиныCRM"
						,причина.НомерСтроки
						,причина.ПричинаОбращенияСодержание
						,причина.ПричинаОбращения.Артикул
						,причина.ПричинаОбращения.Наименование);
						ПричинаОбращенияОтдельнойТаблицей_ОбластьМакета.Параметры.Заполнить(ДанныеДляЗаполнения);
						НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ПричинаОбращенияОтдельнойТаблицей_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул); 
						
					КонецЦикла;
				конецЕсли;
			КонецЕсли;
			
			СтруктураЗН.Вставить("СуммаРаботПоПричине",0);
			СтруктураЗН.Вставить("ИтогНормВремени",0);
			СтруктураЗН.Вставить("СуммаТоварыПоПричине",0);
			СтруктураЗН.Вставить("ИтогТоварыКолВо",0);
			
			ТипРемонта = ?(ЗаказНарядаДокумент.ВидРемонта = Справочники.Должности.ПолучитьСсылку(новый УникальныйИдентификатор("4c571835-70d4-11ed-bcf9-00155d4d9401")),"Г","К");
			
			Если ЗаказНарядаДокумент.АвтоРаботы.Количество()>0 тогда
				Если ШапкаРаботы_ОбластьМакета <> Неопределено тогда
					ШапкаРаботы_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
					НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ШапкаРаботы_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул); 
				КонецЕсли;
				
				Если СтрокаРабот_ОбластьМакета <> Неопределено тогда
					Для Каждого раб ИЗ ЗаказНарядаДокумент.АвтоРаботы Цикл
						ДобавитьРаботуВТД(раб, СтрокаРабот_ОбластьМакета, ТабличныйДокумент, ЗаказНарядаДокумент,, ОбластьПустойСтроки,, НижнийКолонтитул_ОбластьМакета,, НомерСтраницы, Колонтитул);
						СтруктураЗН.Вставить("КоличествоСтрокРабот",раб.НомерСтроки);
						СтруктураЗН.Вставить("ИтогНормВремени",СтруктураЗН.ИтогНормВремени + раб.Коэффициент * раб.Количество);
						СтруктураЗН.Вставить("СуммаРаботПоПричине",СтруктураЗН.СуммаРаботПоПричине + раб.СуммаВсего);
					КонецЦикла;
				КонецЕсли;
				
				Если ПодвалТаблицыРабот_ОбластьМакета <> Неопределено тогда
					ПодвалТаблицыРабот_ОбластьМакета.Параметры.Заполнить(СтруктураЗН); 
					НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ПодвалТаблицыРабот_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул); 
				КонецЕсли;
			КонецЕсли;
			
			Если ЗаказНарядаДокумент.Товары.Количество()>0 тогда
				Если ШапкаТовары_ОбластьМакета <> Неопределено тогда
					ШапкаТовары_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
					НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ШапкаТовары_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул); 
				КонецЕсли;
				
				Если СтрокаТоваров_ОбластьМакета <> Неопределено тогда
					Для Каждого тов ИЗ ЗаказНарядаДокумент.Товары Цикл
						ДобавитьТоварВТД(тов,СтрокаТоваров_ОбластьМакета,ТабличныйДокумент,ЗаказНарядаДокумент,ТипРемонта,ВыводитьАртикул,ОбластьПустойСтроки,,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
						СтруктураЗН.Вставить("КоличествоСтрокТоваров",тов.НомерСтроки); 
						СтруктураЗН.Вставить("СуммаТоварыПоПричине",СтруктураЗН.СуммаТоварыПоПричине + тов.СуммаВсего);
						СтруктураЗН.Вставить("ИтогТоварыКолВо",СтруктураЗН.ИтогТоварыКолВо + тов.Количество);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			СтруктураЗН.Вставить("СуммаПоПричине",СтруктураЗН.СуммаТоварыПоПричине + СтруктураЗН.СуммаРаботПоПричине);
			
			Если ПодвалТаблицыТоваров_ОбластьМакета <> Неопределено тогда
				ПодвалТаблицыТоваров_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
				НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ПодвалТаблицыТоваров_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул); 
			КонецЕсли; 
		КонецЕсли;
		
		Если ИмяМакета = "ПФ_MXL_ЗаказНаряд_НОВАЯ_КУЗОВНОЙ_2020_JLR" Тогда
			Подвал_ОбластьМакета = Макет.ПолучитьОбласть("ПодвалДокумента_1");			
			Подвал_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
			НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,Подвал_ОбластьМакета,ОбластьПустойСтроки,,НижнийКолонтитул_ОбластьМакета,ВерхнийКолонтитул_ОбластьМакета,НомерСтраницы,Колонтитул);

			#Область МатериалыЗаказчика
			Если Третья_ОбластьМакета <> Неопределено тогда
				Третья_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
				НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,Третья_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул); 
			КонецЕсли;         
			
			Если СтрокаМатериалыЗаказчика_ОбластьМакета <> Неопределено тогда
				Если ЗаказНарядаДокумент.МатериалыЗаказчика.Количество()>0 тогда
					Если ШапкаМатериалыЗаказчика_ОбластьМакета <> Неопределено тогда
						ШапкаМатериалыЗаказчика_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
						НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ШапкаМатериалыЗаказчика_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
					КонецЕсли;
					
					Если СтрокаМатериалыЗаказчика_ОбластьМакета <> Неопределено тогда
						Для Каждого тов ИЗ ЗаказНарядаДокумент.МатериалыЗаказчика Цикл
							ДобавитьТоварМатериалыЗаказчикаВТД(тов,СтрокаМатериалыЗаказчика_ОбластьМакета,ТабличныйДокумент,ЗаказНарядаДокумент,ТипРемонта,ВыводитьАртикул,ОбластьПустойСтроки,,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
						КонецЦикла;
					КонецЕсли;
					
					Если ПодвалТаблицыМатериалыЗаказчика_ОбластьМакета <> Неопределено тогда
						ПодвалТаблицыМатериалыЗаказчика_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
						НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ПодвалТаблицыМатериалыЗаказчика_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			#КонецОбласти
			
			Подвал_ОбластьМакета = Макет.ПолучитьОбласть("ПодвалДокумента_2");			
			Подвал_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
			НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,Подвал_ОбластьМакета,ОбластьПустойСтроки,,НижнийКолонтитул_ОбластьМакета,ВерхнийКолонтитул_ОбластьМакета,НомерСтраницы,Колонтитул);			
		Иначе
			#Область МатериалыЗаказчика
			Если Третья_ОбластьМакета <> Неопределено тогда
				Третья_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
				НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,Третья_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул); 
			КонецЕсли;         
			
			Если СтрокаМатериалыЗаказчика_ОбластьМакета <> Неопределено тогда
				Если ЗаказНарядаДокумент.МатериалыЗаказчика.Количество()>0 тогда
					Если ШапкаМатериалыЗаказчика_ОбластьМакета <> Неопределено тогда
						ШапкаМатериалыЗаказчика_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
						НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ШапкаМатериалыЗаказчика_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
					КонецЕсли;
					
					Если СтрокаМатериалыЗаказчика_ОбластьМакета <> Неопределено тогда
						Для Каждого тов ИЗ ЗаказНарядаДокумент.МатериалыЗаказчика Цикл
							ДобавитьТоварМатериалыЗаказчикаВТД(тов,СтрокаМатериалыЗаказчика_ОбластьМакета,ТабличныйДокумент,ЗаказНарядаДокумент,ТипРемонта,ВыводитьАртикул,ОбластьПустойСтроки,,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
						КонецЦикла;
					КонецЕсли;
					
					Если ПодвалТаблицыМатериалыЗаказчика_ОбластьМакета <> Неопределено тогда
						ПодвалТаблицыМатериалыЗаказчика_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
						НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ПодвалТаблицыМатериалыЗаказчика_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			#КонецОбласти
			
			Для каждого ОблМакета из  Макет.Области Цикл
				Если Лев(ОблМакета.Имя, 16) = "ПодвалДокумента_" тогда
					Подвал_ОбластьМакета = Макет.ПолучитьОбласть(ОблМакета.Имя);
					
					Подвал_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
					НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,Подвал_ОбластьМакета,ОбластьПустойСтроки,,НижнийКолонтитул_ОбластьМакета,ВерхнийКолонтитул_ОбластьМакета,НомерСтраницы,Колонтитул);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Для каждого ОблМакета из  Макет.Области Цикл
			Если Лев(ОблМакета.Имя, 17) = "ОборотнаяСторона_" тогда
				ОборотнаяСторона_ОбластьМакета = Макет.ПолучитьОбласть(ОблМакета.Имя);

				ОборотнаяСторона_ОбластьМакета.Параметры.Заполнить(СтруктураЗН);
				НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,ОборотнаяСторона_ОбластьМакета,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул,истина); 
			КонецЕсли; 
		КонецЦикла;
		
		НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,,ОбластьПустойСтроки,ВерхнийКолонтитул_ОбластьМакета,НижнийКолонтитул_ОбластьМакета,,НомерСтраницы,Колонтитул);  
		облСтраницВсего=  ТабличныйДокумент.НайтиТекст("&СтраницВсего");
		
		Пока облСтраницВсего <> Неопределено Цикл 
			облСтраницВсего.Текст = СтрЗаменить(облСтраницВсего.Текст,"&СтраницВсего",НомерСтраницы);
			облСтраницВсего=  ТабличныйДокумент.НайтиТекст("&СтраницВсего");
		КонецЦикла;
		
		//+++ 21.12.2023 Сайфулилин ИП, Бускунов А.Р. -  "Добавление функционала"
		КартинкуЛоготипаМаркиВТабличныйДокумент(ТабличныйДокумент, СтруктураЗН.Автомобиль_Марка);
		//--- 21.12.2023
		
		#КонецОбласти
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ЗаказНарядаДокумент);
		
		//-РАВ 05.09.2025-
		//Если ИмяМакета = "ПФ_XML_НарядКомплексПредварительно_MOSKVICH" Тогда
		//	ЕстьСОПД = ra_ОбщийМодульНаСервере.ПолучитьСОПД(СтруктураЗН.КонтактноеЛицо, ЗаказНарядаДокумент.Организация, ЗаказНарядаДокумент.Дата);
		//	ЕстьСОПД = Неопределено;
		//	
		//	Если ЕстьСОПД = Неопределено ИЛИ НЕ ЕстьСОПД Тогда
		//		СоздатьСОПД 		= Истина;
		//		ВремДок 			= Новый ТабличныйДокумент;
		//		ВремДок.АвтоМасштаб	= ИСТИНА;
		//		
		//		МакетСОПД			= УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказНаряд.ПФ_MXL_СогласиеНаОбработкуПД_MOSKVICH");
		//						
		//		СОПД_Шапка	 		= МакетСОПД.ПолучитьОбласть("Шапка");  
		//		СОПД_Шапка.Параметры.Заполнить(СтруктураЗН); 
		//		
		//		ВремДок.Вывести(СОПД_Шапка);   
		//		
		//		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ВремДок, 1, ОбъектыПечати, ЗаказНарядаДокумент);
		//		
		//		стПечФ = КоллекцияПечатныхФорм.Добавить();
		//		стПечФ.ИмяВРЕГ 		= ВРег("ПФ_MXL_СогласиеНаОбработкуПД_MOSKVICH");
		//		стПечФ.ИмяМакета	= "ПФ_MXL_СогласиеНаОбработкуПД_MOSKVICH"; 
		//		стПечФ.Экземпляров	= 1;
		//		
		//		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		//		"ПФ_MXL_СогласиеНаОбработкуПД_MOSKVICH",
		//		"Согласие на обработку данных",
		//		ВремДок);	
		//		
		//		Если СоздатьСОПД Тогда
		//			//ra_ОбщийМодульНаСервере.СоздатьСогласиеНаОбработкуПерсональныхДанных(ЗаказНарядаДокумент, СтруктураЗН.КонтактноеЛицо)
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;   
		//-РАВ 05.09.2025-		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

#КонецОбласти

#Область Служебные_процедуры_и_функции

Функция 	ПолучитьОбласть(Макет,ИмяОбласти) Экспорт
	попытка
		возврат Макет.ПолучитьОбласть(ИмяОбласти);  
	Исключение   
		возврат Неопределено; 
	КонецПопытки; 
КонецФункции

процедура 	ДобавитьРаботуВТД(раб,СтрокаРабот_ОбластьМакета,ТабличныйДокумент,ЗаказНарядаДокумент,ТипРемонта="К"
	,ОбластьПустойСтроки= Неопределено
	,ОбластьВерхнегоКолонтитула = Неопределено
	,ОбластьНижнегоКолонтитула = Неопределено
	,ОбластьШапкаТаблицы = Неопределено
	,НомерСтраницы = 0
	,Колонтитул = ложь) Экспорт
	ИсполнителиСтроки = ЗаказНарядаДокумент.Исполнители.НайтиСтроки(новый Структура("ИдентификаторРаботы",раб.ИдентификаторРаботы));
	
	Исполнитель = "";
	
	Для каждого исп из ИсполнителиСтроки Цикл 
		Если ПустаяСтрока(Исполнитель) тогда
			Исполнитель = исп.Исполнитель.Наименование; 
		иначе
			Исполнитель = Исполнитель + Символы.ПС + исп.Исполнитель.Наименование; 
		конецЕсли;
	КонецЦикла;
		
	ДанныеДляЗаполнения = новый структура("Тип,Ном,Артикул,Работа,НаименованиеПолноеРаботы,Норма,Цена,Сумма,Скидка,НДС,ЕдИзм,СуммаВсего,Исполнитель,БезНДС, НормаКуз, КоличествоКуз"
	,ТипРемонта
	,раб.НомерСтроки
	,раб.АвтоРабота.Артикул
	,раб.АвтоРабота
	,раб.АвтоРабота.НаименованиеПолное
	,раб.Коэффициент * раб.Количество
	,Окр(раб.Цена,2)
	,раб.Сумма
	,раб.СуммаСкидки + раб.СуммаСкидкиСтроки
	,раб.СуммаНДС
	,"н/ч"
	,раб.СуммаВсего
	,Исполнитель,раб.СуммаВсего - раб.СуммаНДС
	,раб.Коэффициент
	,раб.Количество); 
	
	Если раб.Сумма > 0 Тогда
		ДанныеДляЗаполнения.Вставить("ПроцентТабличный"			, Формат(МАКС(раб.ПроцентСкидки, раб.ПроцентСкидкиСтроки)	,"Л=; ЧДЦ=2; ЧН") + " %");
		ДанныеДляЗаполнения.Вставить("ПроцентТабличный_сокр"	, Формат(МАКС(раб.ПроцентСкидки, раб.ПроцентСкидкиСтроки)	,"Л=; ЧДЦ=0; ЧН"));
		ДанныеДляЗаполнения.Вставить("Процент"					, Формат(ДанныеДляЗаполнения.Скидка / раб.Сумма * 100		,"Л=; ЧДЦ=2; ЧН") + " %");
		ДанныеДляЗаполнения.Вставить("Процент_сокр"				, Формат(ДанныеДляЗаполнения.Скидка / раб.Сумма * 100		,"Л=; ЧДЦ=0; ЧН"));
	Иначе
		ДанныеДляЗаполнения.Вставить("Процент", "100,00%");
	КонецЕсли;
	
	СтрокаРабот_ОбластьМакета.Параметры.Заполнить(ДанныеДляЗаполнения);
	
	Если Колонтитул тогда
		НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,СтрокаРабот_ОбластьМакета
		,ОбластьПустойСтроки,ОбластьВерхнегоКолонтитула,ОбластьНижнегоКолонтитула,ОбластьШапкаТаблицы,НомерСтраницы,Колонтитул);
	иначе
		ТабличныйДокумент.Вывести(СтрокаРабот_ОбластьМакета);
    КонецЕсли;
КонецПроцедуры

процедура 	ДобавитьТоварВТД(тов,СтрокаТоваров_ОбластьМакета,ТабличныйДокумент,ЗаказНарядаДокумент,ТипРемонта = "К",ВыводитьАртикул
	,ОбластьПустойСтроки= Неопределено
	,ОбластьВерхнегоКолонтитула = Неопределено
	,ОбластьНижнегоКолонтитула = Неопределено
	,ОбластьШапкаТаблицы = Неопределено
	,НомерСтраницы = 0
	,Колонтитул = ложь) Экспорт                  
		
	ДанныеДляЗаполнения = новый структура("Тип,Ном,Артикул,Номенклатура,Номенклатура_НаименованиеПолное,КолВо,Цена,Сумма,Скидка,НДС,ЕдИзм,СуммаВсего,ПримечаниеНоменклатураПечать,Получил,Отпустил,БезНДС"
	,ТипРемонта
	,тов.НомерСтроки
	,?(ВыводитьАртикул,тов.Номенклатура.Артикул,"1")
	,тов.Номенклатура
	,тов.Номенклатура.НаименованиеПолное
	,тов.Количество
	,тов.Цена
	,тов.Сумма
	,тов.СуммаСкидки + тов.СуммаСкидкиСтроки 
	,тов.СуммаНДС
	,тов.ЕдиницаИзмерения
	,тов.СуммаВсего
	,тов.ПримечаниеНоменклатураПечать
	,"","",тов.СуммаВсего - тов.СуммаНДС); 
		
	Запрос = новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПеремещениеТоваровВПроизводствоТовары.Ссылка.Отпустил КАК Отпустил,
	|	ПеремещениеТоваровВПроизводствоТовары.Ссылка.Получил КАК Получил
	|ИЗ
	|	Документ.ПеремещениеТоваровВПроизводство.Товары КАК ПеремещениеТоваровВПроизводствоТовары
	|ГДЕ
	|	ПеремещениеТоваровВПроизводствоТовары.Номенклатура = &Номенклатура
	|	И ПеремещениеТоваровВПроизводствоТовары.Ссылка.ДокументОснование = &ДокументОснование
	
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещениеТоваровВПроизводствоТовары.Ссылка.Дата УБЫВ"); 
	Запрос.Параметры.Вставить("ДокументОснование",ЗаказНарядаДокумент);
	Запрос.Параметры.Вставить("Номенклатура",тов.Номенклатура); 
	
	выборка = Запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		  ЗаполнитьЗначенияСвойств(ДанныеДляЗаполнения,выборка);
	КонецЦикла;
		
	Если тов.Сумма > 0 Тогда      
		ДанныеДляЗаполнения.Вставить("ПроцентТабличный"			, Формат(МАКС(тов.ПроцентСкидки, тов.ПроцентСкидкиСтроки)	,"ЧДЦ=2; ЧН") + ?(МАКС(тов.ПроцентСкидки, тов.ПроцентСкидкиСтроки) > 0, " %", ""));   
		ДанныеДляЗаполнения.Вставить("ПроцентТабличный_сокр"	, Формат(МАКС(тов.ПроцентСкидки, тов.ПроцентСкидкиСтроки)	,"Л=; ЧДЦ=0; ЧН"));
		ДанныеДляЗаполнения.Вставить("Процент"					, Формат(тов.СуммаСкидки / тов.Сумма * 100					,"Л=; ЧДЦ=2; ЧН") + ?(тов.СуммаСкидки > 0, " %", ""));   
		ДанныеДляЗаполнения.Вставить("Процент_сокр"				, Формат(тов.СуммаСкидки / тов.Сумма * 100					,"Л=; ЧДЦ=0; ЧН"));			
	Иначе
		ДанныеДляЗаполнения.Вставить("Процент", "100,00%");
	КонецЕсли;  
	
	Если тов.Сумма < тов.СуммаВсего Тогда  //-Есть наценка-
		ДанныеДляЗаполнения.Вставить("ЦенаБезНДСНеОтображатьНаценку"	, Окр(тов.СуммаВсего / тов.Количество, 2));				
		ДанныеДляЗаполнения.Вставить("СуммаБезНДСНеОтображатьНаценку"	, Окр(тов.СуммаВсего - тов.СуммаНДС, 2));				
		ДанныеДляЗаполнения.Вставить("СуммаНДСНеОтображатьНаценку"		, Окр(тов.СуммаНДС, 2));				
	Иначе
		ДанныеДляЗаполнения.Вставить("ЦенаБезНДСНеОтображатьНаценку"	, тов.Цена);				                                                
		ДанныеДляЗаполнения.Вставить("СуммаБезНДСНеОтображатьНаценку"	, ?(тов.СуммаВсего = 0, "", тов.Сумма - тов.СуммаНДС));								
		ДанныеДляЗаполнения.Вставить("СуммаНДСНеОтображатьНаценку"		, тов.СуммаНДС);						
	КонецЕсли;
	
	СтрокаТоваров_ОбластьМакета.Параметры.Заполнить(ДанныеДляЗаполнения);     
	
	Если Колонтитул тогда 
		НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,СтрокаТоваров_ОбластьМакета
		,ОбластьПустойСтроки,ОбластьВерхнегоКолонтитула,ОбластьНижнегоКолонтитула,ОбластьШапкаТаблицы,НомерСтраницы,Колонтитул);  
	иначе
		ТабличныйДокумент.Вывести(СтрокаТоваров_ОбластьМакета);  
	КонецЕсли;
КонецПроцедуры	

процедура 	ДобавитьТоварМатериалыЗаказчикаВТД(тов,СтрокаТоваров_ОбластьМакета,ТабличныйДокумент,ЗаказНарядаДокумент,ТипРемонта = "К",ВыводитьАртикул
	,ОбластьПустойСтроки= Неопределено
	,ОбластьВерхнегоКолонтитула = Неопределено
	,ОбластьНижнегоКолонтитула = Неопределено
	,ОбластьШапкаТаблицы = Неопределено
	,НомерСтраницы = 0
	,Колонтитул = ложь) Экспорт                  
		
	ДанныеДляЗаполнения = новый структура("Тип,Ном,Номенклатура,КолВо,ЕдИзм"
	,ТипРемонта
	,тов.НомерСтроки 
	,тов.Номенклатура 
	,тов.Количество
	,тов.ЕдиницаИзмерения
	); 
		
	СтрокаТоваров_ОбластьМакета.Параметры.Заполнить(ДанныеДляЗаполнения);     
	
	Если Колонтитул тогда 
		НомерСтраницы = ra_ПечатьНаСервере.ВыводВТабДокСКолонтитулами(ТабличныйДокумент,СтрокаТоваров_ОбластьМакета
		,ОбластьПустойСтроки,ОбластьВерхнегоКолонтитула,ОбластьНижнегоКолонтитула,ОбластьШапкаТаблицы,НомерСтраницы,Колонтитул);  
	иначе
		ТабличныйДокумент.Вывести(СтрокаТоваров_ОбластьМакета);  
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти


